GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
// Register: RXF11SIDL
#define RXF11SIDL RXF11SIDL
RXF11SIDL                                equ 0E5Dh
// bitfield definitions
RXF11SIDL_EID_POSN                       equ 0000h
RXF11SIDL_EID_POSITION                   equ 0000h
RXF11SIDL_EID_SIZE                       equ 0002h
RXF11SIDL_EID_LENGTH                     equ 0002h
RXF11SIDL_EID_MASK                       equ 0003h
RXF11SIDL_EXIDEN_POSN                    equ 0003h
RXF11SIDL_EXIDEN_POSITION                equ 0003h
RXF11SIDL_EXIDEN_SIZE                    equ 0001h
RXF11SIDL_EXIDEN_LENGTH                  equ 0001h
RXF11SIDL_EXIDEN_MASK                    equ 0008h
RXF11SIDL_SID_POSN                       equ 0005h
RXF11SIDL_SID_POSITION                   equ 0005h
RXF11SIDL_SID_SIZE                       equ 0003h
RXF11SIDL_SID_LENGTH                     equ 0003h
RXF11SIDL_SID_MASK                       equ 00E0h
RXF11SIDL_EID16_POSN                     equ 0000h
RXF11SIDL_EID16_POSITION                 equ 0000h
RXF11SIDL_EID16_SIZE                     equ 0001h
RXF11SIDL_EID16_LENGTH                   equ 0001h
RXF11SIDL_EID16_MASK                     equ 0001h
RXF11SIDL_EID17_POSN                     equ 0001h
RXF11SIDL_EID17_POSITION                 equ 0001h
RXF11SIDL_EID17_SIZE                     equ 0001h
RXF11SIDL_EID17_LENGTH                   equ 0001h
RXF11SIDL_EID17_MASK                     equ 0002h
RXF11SIDL_SID0_POSN                      equ 0005h
RXF11SIDL_SID0_POSITION                  equ 0005h
RXF11SIDL_SID0_SIZE                      equ 0001h
RXF11SIDL_SID0_LENGTH                    equ 0001h
RXF11SIDL_SID0_MASK                      equ 0020h
RXF11SIDL_SID1_POSN                      equ 0006h
RXF11SIDL_SID1_POSITION                  equ 0006h
RXF11SIDL_SID1_SIZE                      equ 0001h
RXF11SIDL_SID1_LENGTH                    equ 0001h
RXF11SIDL_SID1_MASK                      equ 0040h
RXF11SIDL_SID2_POSN                      equ 0007h
RXF11SIDL_SID2_POSITION                  equ 0007h
RXF11SIDL_SID2_SIZE                      equ 0001h
RXF11SIDL_SID2_LENGTH                    equ 0001h
RXF11SIDL_SID2_MASK                      equ 0080h
RXF11SIDL_RXF11EID16_POSN                equ 0000h
RXF11SIDL_RXF11EID16_POSITION            equ 0000h
RXF11SIDL_RXF11EID16_SIZE                equ 0001h
RXF11SIDL_RXF11EID16_LENGTH              equ 0001h
RXF11SIDL_RXF11EID16_MASK                equ 0001h
RXF11SIDL_RXF11EID17_POSN                equ 0001h
RXF11SIDL_RXF11EID17_POSITION            equ 0001h
RXF11SIDL_RXF11EID17_SIZE                equ 0001h
RXF11SIDL_RXF11EID17_LENGTH              equ 0001h
RXF11SIDL_RXF11EID17_MASK                equ 0002h
RXF11SIDL_RXF11EXIDEN_POSN               equ 0003h
RXF11SIDL_RXF11EXIDEN_POSITION           equ 0003h
RXF11SIDL_RXF11EXIDEN_SIZE               equ 0001h
RXF11SIDL_RXF11EXIDEN_LENGTH             equ 0001h
RXF11SIDL_RXF11EXIDEN_MASK               equ 0008h
RXF11SIDL_RXF11SID0_POSN                 equ 0005h
RXF11SIDL_RXF11SID0_POSITION             equ 0005h
RXF11SIDL_RXF11SID0_SIZE                 equ 0001h
RXF11SIDL_RXF11SID0_LENGTH               equ 0001h
RXF11SIDL_RXF11SID0_MASK                 equ 0020h
RXF11SIDL_RXF11SID1_POSN                 equ 0006h
RXF11SIDL_RXF11SID1_POSITION             equ 0006h
RXF11SIDL_RXF11SID1_SIZE                 equ 0001h
RXF11SIDL_RXF11SID1_LENGTH               equ 0001h
RXF11SIDL_RXF11SID1_MASK                 equ 0040h
RXF11SIDL_RXF11SID2_POSN                 equ 0007h
RXF11SIDL_RXF11SID2_POSITION             equ 0007h
RXF11SIDL_RXF11SID2_SIZE                 equ 0001h
RXF11SIDL_RXF11SID2_LENGTH               equ 0001h
RXF11SIDL_RXF11SID2_MASK                 equ 0080h

// Register: RXF11EIDH
#define RXF11EIDH RXF11EIDH
RXF11EIDH                                equ 0E5Eh
// bitfield definitions
RXF11EIDH_EID_POSN                       equ 0000h
RXF11EIDH_EID_POSITION                   equ 0000h
RXF11EIDH_EID_SIZE                       equ 0008h
RXF11EIDH_EID_LENGTH                     equ 0008h
RXF11EIDH_EID_MASK                       equ 00FFh
RXF11EIDH_EID8_POSN                      equ 0000h
RXF11EIDH_EID8_POSITION                  equ 0000h
RXF11EIDH_EID8_SIZE                      equ 0001h
RXF11EIDH_EID8_LENGTH                    equ 0001h
RXF11EIDH_EID8_MASK                      equ 0001h
RXF11EIDH_EID9_POSN                      equ 0001h
RXF11EIDH_EID9_POSITION                  equ 0001h
RXF11EIDH_EID9_SIZE                      equ 0001h
RXF11EIDH_EID9_LENGTH                    equ 0001h
RXF11EIDH_EID9_MASK                      equ 0002h
RXF11EIDH_EID10_POSN                     equ 0002h
RXF11EIDH_EID10_POSITION                 equ 0002h
RXF11EIDH_EID10_SIZE                     equ 0001h
RXF11EIDH_EID10_LENGTH                   equ 0001h
RXF11EIDH_EID10_MASK                     equ 0004h
RXF11EIDH_EID11_POSN                     equ 0003h
RXF11EIDH_EID11_POSITION                 equ 0003h
RXF11EIDH_EID11_SIZE                     equ 0001h
RXF11EIDH_EID11_LENGTH                   equ 0001h
RXF11EIDH_EID11_MASK                     equ 0008h
RXF11EIDH_EID12_POSN                     equ 0004h
RXF11EIDH_EID12_POSITION                 equ 0004h
RXF11EIDH_EID12_SIZE                     equ 0001h
RXF11EIDH_EID12_LENGTH                   equ 0001h
RXF11EIDH_EID12_MASK                     equ 0010h
RXF11EIDH_EID13_POSN                     equ 0005h
RXF11EIDH_EID13_POSITION                 equ 0005h
RXF11EIDH_EID13_SIZE                     equ 0001h
RXF11EIDH_EID13_LENGTH                   equ 0001h
RXF11EIDH_EID13_MASK                     equ 0020h
RXF11EIDH_EID14_POSN                     equ 0006h
RXF11EIDH_EID14_POSITION                 equ 0006h
RXF11EIDH_EID14_SIZE                     equ 0001h
RXF11EIDH_EID14_LENGTH                   equ 0001h
RXF11EIDH_EID14_MASK                     equ 0040h
RXF11EIDH_EID15_POSN                     equ 0007h
RXF11EIDH_EID15_POSITION                 equ 0007h
RXF11EIDH_EID15_SIZE                     equ 0001h
RXF11EIDH_EID15_LENGTH                   equ 0001h
RXF11EIDH_EID15_MASK                     equ 0080h
RXF11EIDH_RXF11EID8_POSN                 equ 0000h
RXF11EIDH_RXF11EID8_POSITION             equ 0000h
RXF11EIDH_RXF11EID8_SIZE                 equ 0001h
RXF11EIDH_RXF11EID8_LENGTH               equ 0001h
RXF11EIDH_RXF11EID8_MASK                 equ 0001h
RXF11EIDH_RXF11EID9_POSN                 equ 0001h
RXF11EIDH_RXF11EID9_POSITION             equ 0001h
RXF11EIDH_RXF11EID9_SIZE                 equ 0001h
RXF11EIDH_RXF11EID9_LENGTH               equ 0001h
RXF11EIDH_RXF11EID9_MASK                 equ 0002h
RXF11EIDH_RXF11EID10_POSN                equ 0002h
RXF11EIDH_RXF11EID10_POSITION            equ 0002h
RXF11EIDH_RXF11EID10_SIZE                equ 0001h
RXF11EIDH_RXF11EID10_LENGTH              equ 0001h
RXF11EIDH_RXF11EID10_MASK                equ 0004h
RXF11EIDH_RXF11EID11_POSN                equ 0003h
RXF11EIDH_RXF11EID11_POSITION            equ 0003h
RXF11EIDH_RXF11EID11_SIZE                equ 0001h
RXF11EIDH_RXF11EID11_LENGTH              equ 0001h
RXF11EIDH_RXF11EID11_MASK                equ 0008h
RXF11EIDH_RXF11EID12_POSN                equ 0004h
RXF11EIDH_RXF11EID12_POSITION            equ 0004h
RXF11EIDH_RXF11EID12_SIZE                equ 0001h
RXF11EIDH_RXF11EID12_LENGTH              equ 0001h
RXF11EIDH_RXF11EID12_MASK                equ 0010h
RXF11EIDH_RXF11EID13_POSN                equ 0005h
RXF11EIDH_RXF11EID13_POSITION            equ 0005h
RXF11EIDH_RXF11EID13_SIZE                equ 0001h
RXF11EIDH_RXF11EID13_LENGTH              equ 0001h
RXF11EIDH_RXF11EID13_MASK                equ 0020h
RXF11EIDH_RXF11EID14_POSN                equ 0006h
RXF11EIDH_RXF11EID14_POSITION            equ 0006h
RXF11EIDH_RXF11EID14_SIZE                equ 0001h
RXF11EIDH_RXF11EID14_LENGTH              equ 0001h
RXF11EIDH_RXF11EID14_MASK                equ 0040h
RXF11EIDH_RXF11EID15_POSN                equ 0007h
RXF11EIDH_RXF11EID15_POSITION            equ 0007h
RXF11EIDH_RXF11EID15_SIZE                equ 0001h
RXF11EIDH_RXF11EID15_LENGTH              equ 0001h
RXF11EIDH_RXF11EID15_MASK                equ 0080h

// Register: RXF11EIDL
#define RXF11EIDL RXF11EIDL
RXF11EIDL                                equ 0E5Fh
// bitfield definitions
RXF11EIDL_EID_POSN                       equ 0000h
RXF11EIDL_EID_POSITION                   equ 0000h
RXF11EIDL_EID_SIZE                       equ 0008h
RXF11EIDL_EID_LENGTH                     equ 0008h
RXF11EIDL_EID_MASK                       equ 00FFh
RXF11EIDL_EID0_POSN                      equ 0000h
RXF11EIDL_EID0_POSITION                  equ 0000h
RXF11EIDL_EID0_SIZE                      equ 0001h
RXF11EIDL_EID0_LENGTH                    equ 0001h
RXF11EIDL_EID0_MASK                      equ 0001h
RXF11EIDL_EID1_POSN                      equ 0001h
RXF11EIDL_EID1_POSITION                  equ 0001h
RXF11EIDL_EID1_SIZE                      equ 0001h
RXF11EIDL_EID1_LENGTH                    equ 0001h
RXF11EIDL_EID1_MASK                      equ 0002h
RXF11EIDL_EID2_POSN                      equ 0002h
RXF11EIDL_EID2_POSITION                  equ 0002h
RXF11EIDL_EID2_SIZE                      equ 0001h
RXF11EIDL_EID2_LENGTH                    equ 0001h
RXF11EIDL_EID2_MASK                      equ 0004h
RXF11EIDL_EID3_POSN                      equ 0003h
RXF11EIDL_EID3_POSITION                  equ 0003h
RXF11EIDL_EID3_SIZE                      equ 0001h
RXF11EIDL_EID3_LENGTH                    equ 0001h
RXF11EIDL_EID3_MASK                      equ 0008h
RXF11EIDL_EID4_POSN                      equ 0004h
RXF11EIDL_EID4_POSITION                  equ 0004h
RXF11EIDL_EID4_SIZE                      equ 0001h
RXF11EIDL_EID4_LENGTH                    equ 0001h
RXF11EIDL_EID4_MASK                      equ 0010h
RXF11EIDL_EID5_POSN                      equ 0005h
RXF11EIDL_EID5_POSITION                  equ 0005h
RXF11EIDL_EID5_SIZE                      equ 0001h
RXF11EIDL_EID5_LENGTH                    equ 0001h
RXF11EIDL_EID5_MASK                      equ 0020h
RXF11EIDL_EID6_POSN                      equ 0006h
RXF11EIDL_EID6_POSITION                  equ 0006h
RXF11EIDL_EID6_SIZE                      equ 0001h
RXF11EIDL_EID6_LENGTH                    equ 0001h
RXF11EIDL_EID6_MASK                      equ 0040h
RXF11EIDL_EID7_POSN                      equ 0007h
RXF11EIDL_EID7_POSITION                  equ 0007h
RXF11EIDL_EID7_SIZE                      equ 0001h
RXF11EIDL_EID7_LENGTH                    equ 0001h
RXF11EIDL_EID7_MASK                      equ 0080h
RXF11EIDL_RXF11EID0_POSN                 equ 0000h
RXF11EIDL_RXF11EID0_POSITION             equ 0000h
RXF11EIDL_RXF11EID0_SIZE                 equ 0001h
RXF11EIDL_RXF11EID0_LENGTH               equ 0001h
RXF11EIDL_RXF11EID0_MASK                 equ 0001h
RXF11EIDL_RXF11EID1_POSN                 equ 0001h
RXF11EIDL_RXF11EID1_POSITION             equ 0001h
RXF11EIDL_RXF11EID1_SIZE                 equ 0001h
RXF11EIDL_RXF11EID1_LENGTH               equ 0001h
RXF11EIDL_RXF11EID1_MASK                 equ 0002h
RXF11EIDL_RXF11EID2_POSN                 equ 0002h
RXF11EIDL_RXF11EID2_POSITION             equ 0002h
RXF11EIDL_RXF11EID2_SIZE                 equ 0001h
RXF11EIDL_RXF11EID2_LENGTH               equ 0001h
RXF11EIDL_RXF11EID2_MASK                 equ 0004h
RXF11EIDL_RXF11EID3_POSN                 equ 0003h
RXF11EIDL_RXF11EID3_POSITION             equ 0003h
RXF11EIDL_RXF11EID3_SIZE                 equ 0001h
RXF11EIDL_RXF11EID3_LENGTH               equ 0001h
RXF11EIDL_RXF11EID3_MASK                 equ 0008h
RXF11EIDL_RXF11EID4_POSN                 equ 0004h
RXF11EIDL_RXF11EID4_POSITION             equ 0004h
RXF11EIDL_RXF11EID4_SIZE                 equ 0001h
RXF11EIDL_RXF11EID4_LENGTH               equ 0001h
RXF11EIDL_RXF11EID4_MASK                 equ 0010h
RXF11EIDL_RXF11EID5_POSN                 equ 0005h
RXF11EIDL_RXF11EID5_POSITION             equ 0005h
RXF11EIDL_RXF11EID5_SIZE                 equ 0001h
RXF11EIDL_RXF11EID5_LENGTH               equ 0001h
RXF11EIDL_RXF11EID5_MASK                 equ 0020h
RXF11EIDL_RXF11EID6_POSN                 equ 0006h
RXF11EIDL_RXF11EID6_POSITION             equ 0006h
RXF11EIDL_RXF11EID6_SIZE                 equ 0001h
RXF11EIDL_RXF11EID6_LENGTH               equ 0001h
RXF11EIDL_RXF11EID6_MASK                 equ 0040h
RXF11EIDL_RXF11EID7_POSN                 equ 0007h
RXF11EIDL_RXF11EID7_POSITION             equ 0007h
RXF11EIDL_RXF11EID7_SIZE                 equ 0001h
RXF11EIDL_RXF11EID7_LENGTH               equ 0001h
RXF11EIDL_RXF11EID7_MASK                 equ 0080h

// Register: RXF12SIDH
#define RXF12SIDH RXF12SIDH
RXF12SIDH                                equ 0E60h
// bitfield definitions
RXF12SIDH_SID_POSN                       equ 0000h
RXF12SIDH_SID_POSITION                   equ 0000h
RXF12SIDH_SID_SIZE                       equ 0008h
RXF12SIDH_SID_LENGTH                     equ 0008h
RXF12SIDH_SID_MASK                       equ 00FFh
RXF12SIDH_SID3_POSN                      equ 0000h
RXF12SIDH_SID3_POSITION                  equ 0000h
RXF12SIDH_SID3_SIZE                      equ 0001h
RXF12SIDH_SID3_LENGTH                    equ 0001h
RXF12SIDH_SID3_MASK                      equ 0001h
RXF12SIDH_SID4_POSN                      equ 0001h
RXF12SIDH_SID4_POSITION                  equ 0001h
RXF12SIDH_SID4_SIZE                      equ 0001h
RXF12SIDH_SID4_LENGTH                    equ 0001h
RXF12SIDH_SID4_MASK                      equ 0002h
RXF12SIDH_SID5_POSN                      equ 0002h
RXF12SIDH_SID5_POSITION                  equ 0002h
RXF12SIDH_SID5_SIZE                      equ 0001h
RXF12SIDH_SID5_LENGTH                    equ 0001h
RXF12SIDH_SID5_MASK                      equ 0004h
RXF12SIDH_SID6_POSN                      equ 0003h
RXF12SIDH_SID6_POSITION                  equ 0003h
RXF12SIDH_SID6_SIZE                      equ 0001h
RXF12SIDH_SID6_LENGTH                    equ 0001h
RXF12SIDH_SID6_MASK                      equ 0008h
RXF12SIDH_SID7_POSN                      equ 0004h
RXF12SIDH_SID7_POSITION                  equ 0004h
RXF12SIDH_SID7_SIZE                      equ 0001h
RXF12SIDH_SID7_LENGTH                    equ 0001h
RXF12SIDH_SID7_MASK                      equ 0010h
RXF12SIDH_SID8_POSN                      equ 0005h
RXF12SIDH_SID8_POSITION                  equ 0005h
RXF12SIDH_SID8_SIZE                      equ 0001h
RXF12SIDH_SID8_LENGTH                    equ 0001h
RXF12SIDH_SID8_MASK                      equ 0020h
RXF12SIDH_SID9_POSN                      equ 0006h
RXF12SIDH_SID9_POSITION                  equ 0006h
RXF12SIDH_SID9_SIZE                      equ 0001h
RXF12SIDH_SID9_LENGTH                    equ 0001h
RXF12SIDH_SID9_MASK                      equ 0040h
RXF12SIDH_SID10_POSN                     equ 0007h
RXF12SIDH_SID10_POSITION                 equ 0007h
RXF12SIDH_SID10_SIZE                     equ 0001h
RXF12SIDH_SID10_LENGTH                   equ 0001h
RXF12SIDH_SID10_MASK                     equ 0080h
RXF12SIDH_RXF12SID3_POSN                 equ 0000h
RXF12SIDH_RXF12SID3_POSITION             equ 0000h
RXF12SIDH_RXF12SID3_SIZE                 equ 0001h
RXF12SIDH_RXF12SID3_LENGTH               equ 0001h
RXF12SIDH_RXF12SID3_MASK                 equ 0001h
RXF12SIDH_RXF12SID4_POSN                 equ 0001h
RXF12SIDH_RXF12SID4_POSITION             equ 0001h
RXF12SIDH_RXF12SID4_SIZE                 equ 0001h
RXF12SIDH_RXF12SID4_LENGTH               equ 0001h
RXF12SIDH_RXF12SID4_MASK                 equ 0002h
RXF12SIDH_RXF12SID5_POSN                 equ 0002h
RXF12SIDH_RXF12SID5_POSITION             equ 0002h
RXF12SIDH_RXF12SID5_SIZE                 equ 0001h
RXF12SIDH_RXF12SID5_LENGTH               equ 0001h
RXF12SIDH_RXF12SID5_MASK                 equ 0004h
RXF12SIDH_RXF12SID6_POSN                 equ 0003h
RXF12SIDH_RXF12SID6_POSITION             equ 0003h
RXF12SIDH_RXF12SID6_SIZE                 equ 0001h
RXF12SIDH_RXF12SID6_LENGTH               equ 0001h
RXF12SIDH_RXF12SID6_MASK                 equ 0008h
RXF12SIDH_RXF12SID7_POSN                 equ 0004h
RXF12SIDH_RXF12SID7_POSITION             equ 0004h
RXF12SIDH_RXF12SID7_SIZE                 equ 0001h
RXF12SIDH_RXF12SID7_LENGTH               equ 0001h
RXF12SIDH_RXF12SID7_MASK                 equ 0010h
RXF12SIDH_RXF12SID8_POSN                 equ 0005h
RXF12SIDH_RXF12SID8_POSITION             equ 0005h
RXF12SIDH_RXF12SID8_SIZE                 equ 0001h
RXF12SIDH_RXF12SID8_LENGTH               equ 0001h
RXF12SIDH_RXF12SID8_MASK                 equ 0020h
RXF12SIDH_RXF12SID9_POSN                 equ 0006h
RXF12SIDH_RXF12SID9_POSITION             equ 0006h
RXF12SIDH_RXF12SID9_SIZE                 equ 0001h
RXF12SIDH_RXF12SID9_LENGTH               equ 0001h
RXF12SIDH_RXF12SID9_MASK                 equ 0040h
RXF12SIDH_RXF12SID10_POSN                equ 0007h
RXF12SIDH_RXF12SID10_POSITION            equ 0007h
RXF12SIDH_RXF12SID10_SIZE                equ 0001h
RXF12SIDH_RXF12SID10_LENGTH              equ 0001h
RXF12SIDH_RXF12SID10_MASK                equ 0080h

