GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
// Register: B0DLC
#define B0DLC B0DLC
B0DLC                                    equ 0E85h
// bitfield definitions
B0DLC_DLC_POSN                           equ 0000h
B0DLC_DLC_POSITION                       equ 0000h
B0DLC_DLC_SIZE                           equ 0004h
B0DLC_DLC_LENGTH                         equ 0004h
B0DLC_DLC_MASK                           equ 000Fh
B0DLC_RB_POSN                            equ 0004h
B0DLC_RB_POSITION                        equ 0004h
B0DLC_RB_SIZE                            equ 0002h
B0DLC_RB_LENGTH                          equ 0002h
B0DLC_RB_MASK                            equ 0030h
B0DLC_RXRTR_TXRTR_POSN                   equ 0006h
B0DLC_RXRTR_TXRTR_POSITION               equ 0006h
B0DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B0DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B0DLC_RXRTR_TXRTR_MASK                   equ 0040h
B0DLC_DLC0_POSN                          equ 0000h
B0DLC_DLC0_POSITION                      equ 0000h
B0DLC_DLC0_SIZE                          equ 0001h
B0DLC_DLC0_LENGTH                        equ 0001h
B0DLC_DLC0_MASK                          equ 0001h
B0DLC_DLC1_POSN                          equ 0001h
B0DLC_DLC1_POSITION                      equ 0001h
B0DLC_DLC1_SIZE                          equ 0001h
B0DLC_DLC1_LENGTH                        equ 0001h
B0DLC_DLC1_MASK                          equ 0002h
B0DLC_DLC2_POSN                          equ 0002h
B0DLC_DLC2_POSITION                      equ 0002h
B0DLC_DLC2_SIZE                          equ 0001h
B0DLC_DLC2_LENGTH                        equ 0001h
B0DLC_DLC2_MASK                          equ 0004h
B0DLC_DLC3_POSN                          equ 0003h
B0DLC_DLC3_POSITION                      equ 0003h
B0DLC_DLC3_SIZE                          equ 0001h
B0DLC_DLC3_LENGTH                        equ 0001h
B0DLC_DLC3_MASK                          equ 0008h
B0DLC_RB0_POSN                           equ 0004h
B0DLC_RB0_POSITION                       equ 0004h
B0DLC_RB0_SIZE                           equ 0001h
B0DLC_RB0_LENGTH                         equ 0001h
B0DLC_RB0_MASK                           equ 0010h
B0DLC_RB1_POSN                           equ 0005h
B0DLC_RB1_POSITION                       equ 0005h
B0DLC_RB1_SIZE                           equ 0001h
B0DLC_RB1_LENGTH                         equ 0001h
B0DLC_RB1_MASK                           equ 0020h
B0DLC_RXRTR_POSN                         equ 0006h
B0DLC_RXRTR_POSITION                     equ 0006h
B0DLC_RXRTR_SIZE                         equ 0001h
B0DLC_RXRTR_LENGTH                       equ 0001h
B0DLC_RXRTR_MASK                         equ 0040h
B0DLC_TXRTR_POSN                         equ 0006h
B0DLC_TXRTR_POSITION                     equ 0006h
B0DLC_TXRTR_SIZE                         equ 0001h
B0DLC_TXRTR_LENGTH                       equ 0001h
B0DLC_TXRTR_MASK                         equ 0040h
B0DLC_B0DLC0_POSN                        equ 0000h
B0DLC_B0DLC0_POSITION                    equ 0000h
B0DLC_B0DLC0_SIZE                        equ 0001h
B0DLC_B0DLC0_LENGTH                      equ 0001h
B0DLC_B0DLC0_MASK                        equ 0001h
B0DLC_B0DLC1_POSN                        equ 0001h
B0DLC_B0DLC1_POSITION                    equ 0001h
B0DLC_B0DLC1_SIZE                        equ 0001h
B0DLC_B0DLC1_LENGTH                      equ 0001h
B0DLC_B0DLC1_MASK                        equ 0002h
B0DLC_B0DLC2_POSN                        equ 0002h
B0DLC_B0DLC2_POSITION                    equ 0002h
B0DLC_B0DLC2_SIZE                        equ 0001h
B0DLC_B0DLC2_LENGTH                      equ 0001h
B0DLC_B0DLC2_MASK                        equ 0004h
B0DLC_B0DLC3_POSN                        equ 0003h
B0DLC_B0DLC3_POSITION                    equ 0003h
B0DLC_B0DLC3_SIZE                        equ 0001h
B0DLC_B0DLC3_LENGTH                      equ 0001h
B0DLC_B0DLC3_MASK                        equ 0008h
B0DLC_B0RB0_POSN                         equ 0004h
B0DLC_B0RB0_POSITION                     equ 0004h
B0DLC_B0RB0_SIZE                         equ 0001h
B0DLC_B0RB0_LENGTH                       equ 0001h
B0DLC_B0RB0_MASK                         equ 0010h
B0DLC_B0RB1_POSN                         equ 0005h
B0DLC_B0RB1_POSITION                     equ 0005h
B0DLC_B0RB1_SIZE                         equ 0001h
B0DLC_B0RB1_LENGTH                       equ 0001h
B0DLC_B0RB1_MASK                         equ 0020h
B0DLC_B0RXRTR_POSN                       equ 0006h
B0DLC_B0RXRTR_POSITION                   equ 0006h
B0DLC_B0RXRTR_SIZE                       equ 0001h
B0DLC_B0RXRTR_LENGTH                     equ 0001h
B0DLC_B0RXRTR_MASK                       equ 0040h

// Register: B0D0
#define B0D0 B0D0
B0D0                                     equ 0E86h
// bitfield definitions
B0D0_B0D0_POSN                           equ 0000h
B0D0_B0D0_POSITION                       equ 0000h
B0D0_B0D0_SIZE                           equ 0008h
B0D0_B0D0_LENGTH                         equ 0008h
B0D0_B0D0_MASK                           equ 00FFh
B0D0_B0D00_POSN                          equ 0000h
B0D0_B0D00_POSITION                      equ 0000h
B0D0_B0D00_SIZE                          equ 0001h
B0D0_B0D00_LENGTH                        equ 0001h
B0D0_B0D00_MASK                          equ 0001h
B0D0_B0D01_POSN                          equ 0001h
B0D0_B0D01_POSITION                      equ 0001h
B0D0_B0D01_SIZE                          equ 0001h
B0D0_B0D01_LENGTH                        equ 0001h
B0D0_B0D01_MASK                          equ 0002h
B0D0_B0D02_POSN                          equ 0002h
B0D0_B0D02_POSITION                      equ 0002h
B0D0_B0D02_SIZE                          equ 0001h
B0D0_B0D02_LENGTH                        equ 0001h
B0D0_B0D02_MASK                          equ 0004h
B0D0_B0D03_POSN                          equ 0003h
B0D0_B0D03_POSITION                      equ 0003h
B0D0_B0D03_SIZE                          equ 0001h
B0D0_B0D03_LENGTH                        equ 0001h
B0D0_B0D03_MASK                          equ 0008h
B0D0_B0D04_POSN                          equ 0004h
B0D0_B0D04_POSITION                      equ 0004h
B0D0_B0D04_SIZE                          equ 0001h
B0D0_B0D04_LENGTH                        equ 0001h
B0D0_B0D04_MASK                          equ 0010h
B0D0_B0D05_POSN                          equ 0005h
B0D0_B0D05_POSITION                      equ 0005h
B0D0_B0D05_SIZE                          equ 0001h
B0D0_B0D05_LENGTH                        equ 0001h
B0D0_B0D05_MASK                          equ 0020h
B0D0_B0D06_POSN                          equ 0006h
B0D0_B0D06_POSITION                      equ 0006h
B0D0_B0D06_SIZE                          equ 0001h
B0D0_B0D06_LENGTH                        equ 0001h
B0D0_B0D06_MASK                          equ 0040h
B0D0_B0D07_POSN                          equ 0007h
B0D0_B0D07_POSITION                      equ 0007h
B0D0_B0D07_SIZE                          equ 0001h
B0D0_B0D07_LENGTH                        equ 0001h
B0D0_B0D07_MASK                          equ 0080h

// Register: B0D1
#define B0D1 B0D1
B0D1                                     equ 0E87h
// bitfield definitions
B0D1_B0D1_POSN                           equ 0000h
B0D1_B0D1_POSITION                       equ 0000h
B0D1_B0D1_SIZE                           equ 0008h
B0D1_B0D1_LENGTH                         equ 0008h
B0D1_B0D1_MASK                           equ 00FFh
B0D1_B0D10_POSN                          equ 0000h
B0D1_B0D10_POSITION                      equ 0000h
B0D1_B0D10_SIZE                          equ 0001h
B0D1_B0D10_LENGTH                        equ 0001h
B0D1_B0D10_MASK                          equ 0001h
B0D1_B0D11_POSN                          equ 0001h
B0D1_B0D11_POSITION                      equ 0001h
B0D1_B0D11_SIZE                          equ 0001h
B0D1_B0D11_LENGTH                        equ 0001h
B0D1_B0D11_MASK                          equ 0002h
B0D1_B0D12_POSN                          equ 0002h
B0D1_B0D12_POSITION                      equ 0002h
B0D1_B0D12_SIZE                          equ 0001h
B0D1_B0D12_LENGTH                        equ 0001h
B0D1_B0D12_MASK                          equ 0004h
B0D1_B0D13_POSN                          equ 0003h
B0D1_B0D13_POSITION                      equ 0003h
B0D1_B0D13_SIZE                          equ 0001h
B0D1_B0D13_LENGTH                        equ 0001h
B0D1_B0D13_MASK                          equ 0008h
B0D1_B0D14_POSN                          equ 0004h
B0D1_B0D14_POSITION                      equ 0004h
B0D1_B0D14_SIZE                          equ 0001h
B0D1_B0D14_LENGTH                        equ 0001h
B0D1_B0D14_MASK                          equ 0010h
B0D1_B0D15_POSN                          equ 0005h
B0D1_B0D15_POSITION                      equ 0005h
B0D1_B0D15_SIZE                          equ 0001h
B0D1_B0D15_LENGTH                        equ 0001h
B0D1_B0D15_MASK                          equ 0020h
B0D1_B0D16_POSN                          equ 0006h
B0D1_B0D16_POSITION                      equ 0006h
B0D1_B0D16_SIZE                          equ 0001h
B0D1_B0D16_LENGTH                        equ 0001h
B0D1_B0D16_MASK                          equ 0040h
B0D1_B0D17_POSN                          equ 0007h
B0D1_B0D17_POSITION                      equ 0007h
B0D1_B0D17_SIZE                          equ 0001h
B0D1_B0D17_LENGTH                        equ 0001h
B0D1_B0D17_MASK                          equ 0080h

// Register: B0D2
#define B0D2 B0D2
B0D2                                     equ 0E88h
// bitfield definitions
B0D2_B0D2_POSN                           equ 0000h
B0D2_B0D2_POSITION                       equ 0000h
B0D2_B0D2_SIZE                           equ 0008h
B0D2_B0D2_LENGTH                         equ 0008h
B0D2_B0D2_MASK                           equ 00FFh
B0D2_B0D20_POSN                          equ 0000h
B0D2_B0D20_POSITION                      equ 0000h
B0D2_B0D20_SIZE                          equ 0001h
B0D2_B0D20_LENGTH                        equ 0001h
B0D2_B0D20_MASK                          equ 0001h
B0D2_B0D21_POSN                          equ 0001h
B0D2_B0D21_POSITION                      equ 0001h
B0D2_B0D21_SIZE                          equ 0001h
B0D2_B0D21_LENGTH                        equ 0001h
B0D2_B0D21_MASK                          equ 0002h
B0D2_B0D22_POSN                          equ 0002h
B0D2_B0D22_POSITION                      equ 0002h
B0D2_B0D22_SIZE                          equ 0001h
B0D2_B0D22_LENGTH                        equ 0001h
B0D2_B0D22_MASK                          equ 0004h
B0D2_B0D23_POSN                          equ 0003h
B0D2_B0D23_POSITION                      equ 0003h
B0D2_B0D23_SIZE                          equ 0001h
B0D2_B0D23_LENGTH                        equ 0001h
B0D2_B0D23_MASK                          equ 0008h
B0D2_B0D24_POSN                          equ 0004h
B0D2_B0D24_POSITION                      equ 0004h
B0D2_B0D24_SIZE                          equ 0001h
B0D2_B0D24_LENGTH                        equ 0001h
B0D2_B0D24_MASK                          equ 0010h
B0D2_B0D25_POSN                          equ 0005h
B0D2_B0D25_POSITION                      equ 0005h
B0D2_B0D25_SIZE                          equ 0001h
B0D2_B0D25_LENGTH                        equ 0001h
B0D2_B0D25_MASK                          equ 0020h
B0D2_B0D26_POSN                          equ 0006h
B0D2_B0D26_POSITION                      equ 0006h
B0D2_B0D26_SIZE                          equ 0001h
B0D2_B0D26_LENGTH                        equ 0001h
B0D2_B0D26_MASK                          equ 0040h
B0D2_B0D27_POSN                          equ 0007h
B0D2_B0D27_POSITION                      equ 0007h
B0D2_B0D27_SIZE                          equ 0001h
B0D2_B0D27_LENGTH                        equ 0001h
B0D2_B0D27_MASK                          equ 0080h

// Register: B0D3
#define B0D3 B0D3
B0D3                                     equ 0E89h
// bitfield definitions
B0D3_B0D3_POSN                           equ 0000h
B0D3_B0D3_POSITION                       equ 0000h
B0D3_B0D3_SIZE                           equ 0008h
B0D3_B0D3_LENGTH                         equ 0008h
B0D3_B0D3_MASK                           equ 00FFh
B0D3_B0D30_POSN                          equ 0000h
B0D3_B0D30_POSITION                      equ 0000h
B0D3_B0D30_SIZE                          equ 0001h
B0D3_B0D30_LENGTH                        equ 0001h
B0D3_B0D30_MASK                          equ 0001h
B0D3_B0D31_POSN                          equ 0001h
B0D3_B0D31_POSITION                      equ 0001h
B0D3_B0D31_SIZE                          equ 0001h
B0D3_B0D31_LENGTH                        equ 0001h
B0D3_B0D31_MASK                          equ 0002h
B0D3_B0D32_POSN                          equ 0002h
B0D3_B0D32_POSITION                      equ 0002h
B0D3_B0D32_SIZE                          equ 0001h
B0D3_B0D32_LENGTH                        equ 0001h
B0D3_B0D32_MASK                          equ 0004h
B0D3_B0D33_POSN                          equ 0003h
B0D3_B0D33_POSITION                      equ 0003h
B0D3_B0D33_SIZE                          equ 0001h
B0D3_B0D33_LENGTH                        equ 0001h
B0D3_B0D33_MASK                          equ 0008h
B0D3_B0D34_POSN                          equ 0004h
B0D3_B0D34_POSITION                      equ 0004h
B0D3_B0D34_SIZE                          equ 0001h
B0D3_B0D34_LENGTH                        equ 0001h
B0D3_B0D34_MASK                          equ 0010h
B0D3_B0D35_POSN                          equ 0005h
B0D3_B0D35_POSITION                      equ 0005h
B0D3_B0D35_SIZE                          equ 0001h
B0D3_B0D35_LENGTH                        equ 0001h
B0D3_B0D35_MASK                          equ 0020h
B0D3_B0D36_POSN                          equ 0006h
B0D3_B0D36_POSITION                      equ 0006h
B0D3_B0D36_SIZE                          equ 0001h
B0D3_B0D36_LENGTH                        equ 0001h
B0D3_B0D36_MASK                          equ 0040h
B0D3_B0D37_POSN                          equ 0007h
B0D3_B0D37_POSITION                      equ 0007h
B0D3_B0D37_SIZE                          equ 0001h
B0D3_B0D37_LENGTH                        equ 0001h
B0D3_B0D37_MASK                          equ 0080h

// Register: B0D4
#define B0D4 B0D4
B0D4                                     equ 0E8Ah
// bitfield definitions
B0D4_B0D4_POSN                           equ 0000h
B0D4_B0D4_POSITION                       equ 0000h
B0D4_B0D4_SIZE                           equ 0008h
B0D4_B0D4_LENGTH                         equ 0008h
B0D4_B0D4_MASK                           equ 00FFh
B0D4_B0D40_POSN                          equ 0000h
B0D4_B0D40_POSITION                      equ 0000h
B0D4_B0D40_SIZE                          equ 0001h
B0D4_B0D40_LENGTH                        equ 0001h
B0D4_B0D40_MASK                          equ 0001h
B0D4_B0D41_POSN                          equ 0001h
B0D4_B0D41_POSITION                      equ 0001h
B0D4_B0D41_SIZE                          equ 0001h
B0D4_B0D41_LENGTH                        equ 0001h
B0D4_B0D41_MASK                          equ 0002h
B0D4_B0D42_POSN                          equ 0002h
B0D4_B0D42_POSITION                      equ 0002h
B0D4_B0D42_SIZE                          equ 0001h
B0D4_B0D42_LENGTH                        equ 0001h
B0D4_B0D42_MASK                          equ 0004h
B0D4_B0D43_POSN                          equ 0003h
B0D4_B0D43_POSITION                      equ 0003h
B0D4_B0D43_SIZE                          equ 0001h
B0D4_B0D43_LENGTH                        equ 0001h
B0D4_B0D43_MASK                          equ 0008h
B0D4_B0D44_POSN                          equ 0004h
B0D4_B0D44_POSITION                      equ 0004h
B0D4_B0D44_SIZE                          equ 0001h
B0D4_B0D44_LENGTH                        equ 0001h
B0D4_B0D44_MASK                          equ 0010h
B0D4_B0D45_POSN                          equ 0005h
B0D4_B0D45_POSITION                      equ 0005h
B0D4_B0D45_SIZE                          equ 0001h
B0D4_B0D45_LENGTH                        equ 0001h
B0D4_B0D45_MASK                          equ 0020h
B0D4_B0D46_POSN                          equ 0006h
B0D4_B0D46_POSITION                      equ 0006h
B0D4_B0D46_SIZE                          equ 0001h
B0D4_B0D46_LENGTH                        equ 0001h
B0D4_B0D46_MASK                          equ 0040h
B0D4_B0D47_POSN                          equ 0007h
B0D4_B0D47_POSITION                      equ 0007h
B0D4_B0D47_SIZE                          equ 0001h
B0D4_B0D47_LENGTH                        equ 0001h
B0D4_B0D47_MASK                          equ 0080h

