GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
// Register: RXF2SIDH
#define RXF2SIDH RXF2SIDH
RXF2SIDH                                 equ 0EE8h
// bitfield definitions
RXF2SIDH_SID_POSN                        equ 0000h
RXF2SIDH_SID_POSITION                    equ 0000h
RXF2SIDH_SID_SIZE                        equ 0008h
RXF2SIDH_SID_LENGTH                      equ 0008h
RXF2SIDH_SID_MASK                        equ 00FFh
RXF2SIDH_SID3_POSN                       equ 0000h
RXF2SIDH_SID3_POSITION                   equ 0000h
RXF2SIDH_SID3_SIZE                       equ 0001h
RXF2SIDH_SID3_LENGTH                     equ 0001h
RXF2SIDH_SID3_MASK                       equ 0001h
RXF2SIDH_SID4_POSN                       equ 0001h
RXF2SIDH_SID4_POSITION                   equ 0001h
RXF2SIDH_SID4_SIZE                       equ 0001h
RXF2SIDH_SID4_LENGTH                     equ 0001h
RXF2SIDH_SID4_MASK                       equ 0002h
RXF2SIDH_SID5_POSN                       equ 0002h
RXF2SIDH_SID5_POSITION                   equ 0002h
RXF2SIDH_SID5_SIZE                       equ 0001h
RXF2SIDH_SID5_LENGTH                     equ 0001h
RXF2SIDH_SID5_MASK                       equ 0004h
RXF2SIDH_SID6_POSN                       equ 0003h
RXF2SIDH_SID6_POSITION                   equ 0003h
RXF2SIDH_SID6_SIZE                       equ 0001h
RXF2SIDH_SID6_LENGTH                     equ 0001h
RXF2SIDH_SID6_MASK                       equ 0008h
RXF2SIDH_SID7_POSN                       equ 0004h
RXF2SIDH_SID7_POSITION                   equ 0004h
RXF2SIDH_SID7_SIZE                       equ 0001h
RXF2SIDH_SID7_LENGTH                     equ 0001h
RXF2SIDH_SID7_MASK                       equ 0010h
RXF2SIDH_SID8_POSN                       equ 0005h
RXF2SIDH_SID8_POSITION                   equ 0005h
RXF2SIDH_SID8_SIZE                       equ 0001h
RXF2SIDH_SID8_LENGTH                     equ 0001h
RXF2SIDH_SID8_MASK                       equ 0020h
RXF2SIDH_SID9_POSN                       equ 0006h
RXF2SIDH_SID9_POSITION                   equ 0006h
RXF2SIDH_SID9_SIZE                       equ 0001h
RXF2SIDH_SID9_LENGTH                     equ 0001h
RXF2SIDH_SID9_MASK                       equ 0040h
RXF2SIDH_SID10_POSN                      equ 0007h
RXF2SIDH_SID10_POSITION                  equ 0007h
RXF2SIDH_SID10_SIZE                      equ 0001h
RXF2SIDH_SID10_LENGTH                    equ 0001h
RXF2SIDH_SID10_MASK                      equ 0080h
RXF2SIDH_RXF2SID3_POSN                   equ 0000h
RXF2SIDH_RXF2SID3_POSITION               equ 0000h
RXF2SIDH_RXF2SID3_SIZE                   equ 0001h
RXF2SIDH_RXF2SID3_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID3_MASK                   equ 0001h
RXF2SIDH_RXF2SID4_POSN                   equ 0001h
RXF2SIDH_RXF2SID4_POSITION               equ 0001h
RXF2SIDH_RXF2SID4_SIZE                   equ 0001h
RXF2SIDH_RXF2SID4_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID4_MASK                   equ 0002h
RXF2SIDH_RXF2SID5_POSN                   equ 0002h
RXF2SIDH_RXF2SID5_POSITION               equ 0002h
RXF2SIDH_RXF2SID5_SIZE                   equ 0001h
RXF2SIDH_RXF2SID5_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID5_MASK                   equ 0004h
RXF2SIDH_RXF2SID6_POSN                   equ 0003h
RXF2SIDH_RXF2SID6_POSITION               equ 0003h
RXF2SIDH_RXF2SID6_SIZE                   equ 0001h
RXF2SIDH_RXF2SID6_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID6_MASK                   equ 0008h
RXF2SIDH_RXF2SID7_POSN                   equ 0004h
RXF2SIDH_RXF2SID7_POSITION               equ 0004h
RXF2SIDH_RXF2SID7_SIZE                   equ 0001h
RXF2SIDH_RXF2SID7_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID7_MASK                   equ 0010h
RXF2SIDH_RXF2SID8_POSN                   equ 0005h
RXF2SIDH_RXF2SID8_POSITION               equ 0005h
RXF2SIDH_RXF2SID8_SIZE                   equ 0001h
RXF2SIDH_RXF2SID8_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID8_MASK                   equ 0020h
RXF2SIDH_RXF2SID9_POSN                   equ 0006h
RXF2SIDH_RXF2SID9_POSITION               equ 0006h
RXF2SIDH_RXF2SID9_SIZE                   equ 0001h
RXF2SIDH_RXF2SID9_LENGTH                 equ 0001h
RXF2SIDH_RXF2SID9_MASK                   equ 0040h
RXF2SIDH_RXF2SID10_POSN                  equ 0007h
RXF2SIDH_RXF2SID10_POSITION              equ 0007h
RXF2SIDH_RXF2SID10_SIZE                  equ 0001h
RXF2SIDH_RXF2SID10_LENGTH                equ 0001h
RXF2SIDH_RXF2SID10_MASK                  equ 0080h

// Register: RXF2SIDL
#define RXF2SIDL RXF2SIDL
RXF2SIDL                                 equ 0EE9h
// bitfield definitions
RXF2SIDL_EID_POSN                        equ 0000h
RXF2SIDL_EID_POSITION                    equ 0000h
RXF2SIDL_EID_SIZE                        equ 0002h
RXF2SIDL_EID_LENGTH                      equ 0002h
RXF2SIDL_EID_MASK                        equ 0003h
RXF2SIDL_EXIDEN_POSN                     equ 0003h
RXF2SIDL_EXIDEN_POSITION                 equ 0003h
RXF2SIDL_EXIDEN_SIZE                     equ 0001h
RXF2SIDL_EXIDEN_LENGTH                   equ 0001h
RXF2SIDL_EXIDEN_MASK                     equ 0008h
RXF2SIDL_SID_POSN                        equ 0005h
RXF2SIDL_SID_POSITION                    equ 0005h
RXF2SIDL_SID_SIZE                        equ 0003h
RXF2SIDL_SID_LENGTH                      equ 0003h
RXF2SIDL_SID_MASK                        equ 00E0h
RXF2SIDL_EID16_POSN                      equ 0000h
RXF2SIDL_EID16_POSITION                  equ 0000h
RXF2SIDL_EID16_SIZE                      equ 0001h
RXF2SIDL_EID16_LENGTH                    equ 0001h
RXF2SIDL_EID16_MASK                      equ 0001h
RXF2SIDL_EID17_POSN                      equ 0001h
RXF2SIDL_EID17_POSITION                  equ 0001h
RXF2SIDL_EID17_SIZE                      equ 0001h
RXF2SIDL_EID17_LENGTH                    equ 0001h
RXF2SIDL_EID17_MASK                      equ 0002h
RXF2SIDL_SID0_POSN                       equ 0005h
RXF2SIDL_SID0_POSITION                   equ 0005h
RXF2SIDL_SID0_SIZE                       equ 0001h
RXF2SIDL_SID0_LENGTH                     equ 0001h
RXF2SIDL_SID0_MASK                       equ 0020h
RXF2SIDL_SID1_POSN                       equ 0006h
RXF2SIDL_SID1_POSITION                   equ 0006h
RXF2SIDL_SID1_SIZE                       equ 0001h
RXF2SIDL_SID1_LENGTH                     equ 0001h
RXF2SIDL_SID1_MASK                       equ 0040h
RXF2SIDL_SID2_POSN                       equ 0007h
RXF2SIDL_SID2_POSITION                   equ 0007h
RXF2SIDL_SID2_SIZE                       equ 0001h
RXF2SIDL_SID2_LENGTH                     equ 0001h
RXF2SIDL_SID2_MASK                       equ 0080h
RXF2SIDL_RXF2EID16_POSN                  equ 0000h
RXF2SIDL_RXF2EID16_POSITION              equ 0000h
RXF2SIDL_RXF2EID16_SIZE                  equ 0001h
RXF2SIDL_RXF2EID16_LENGTH                equ 0001h
RXF2SIDL_RXF2EID16_MASK                  equ 0001h
RXF2SIDL_RXF2EID17_POSN                  equ 0001h
RXF2SIDL_RXF2EID17_POSITION              equ 0001h
RXF2SIDL_RXF2EID17_SIZE                  equ 0001h
RXF2SIDL_RXF2EID17_LENGTH                equ 0001h
RXF2SIDL_RXF2EID17_MASK                  equ 0002h
RXF2SIDL_RXF2EXIDEN_POSN                 equ 0003h
RXF2SIDL_RXF2EXIDEN_POSITION             equ 0003h
RXF2SIDL_RXF2EXIDEN_SIZE                 equ 0001h
RXF2SIDL_RXF2EXIDEN_LENGTH               equ 0001h
RXF2SIDL_RXF2EXIDEN_MASK                 equ 0008h
RXF2SIDL_RXF2SID0_POSN                   equ 0005h
RXF2SIDL_RXF2SID0_POSITION               equ 0005h
RXF2SIDL_RXF2SID0_SIZE                   equ 0001h
RXF2SIDL_RXF2SID0_LENGTH                 equ 0001h
RXF2SIDL_RXF2SID0_MASK                   equ 0020h
RXF2SIDL_RXF2SID1_POSN                   equ 0006h
RXF2SIDL_RXF2SID1_POSITION               equ 0006h
RXF2SIDL_RXF2SID1_SIZE                   equ 0001h
RXF2SIDL_RXF2SID1_LENGTH                 equ 0001h
RXF2SIDL_RXF2SID1_MASK                   equ 0040h
RXF2SIDL_RXF2SID2_POSN                   equ 0007h
RXF2SIDL_RXF2SID2_POSITION               equ 0007h
RXF2SIDL_RXF2SID2_SIZE                   equ 0001h
RXF2SIDL_RXF2SID2_LENGTH                 equ 0001h
RXF2SIDL_RXF2SID2_MASK                   equ 0080h

// Register: RXF2EIDH
#define RXF2EIDH RXF2EIDH
RXF2EIDH                                 equ 0EEAh
// bitfield definitions
RXF2EIDH_EID_POSN                        equ 0000h
RXF2EIDH_EID_POSITION                    equ 0000h
RXF2EIDH_EID_SIZE                        equ 0008h
RXF2EIDH_EID_LENGTH                      equ 0008h
RXF2EIDH_EID_MASK                        equ 00FFh
RXF2EIDH_EID8_POSN                       equ 0000h
RXF2EIDH_EID8_POSITION                   equ 0000h
RXF2EIDH_EID8_SIZE                       equ 0001h
RXF2EIDH_EID8_LENGTH                     equ 0001h
RXF2EIDH_EID8_MASK                       equ 0001h
RXF2EIDH_EID9_POSN                       equ 0001h
RXF2EIDH_EID9_POSITION                   equ 0001h
RXF2EIDH_EID9_SIZE                       equ 0001h
RXF2EIDH_EID9_LENGTH                     equ 0001h
RXF2EIDH_EID9_MASK                       equ 0002h
RXF2EIDH_EID10_POSN                      equ 0002h
RXF2EIDH_EID10_POSITION                  equ 0002h
RXF2EIDH_EID10_SIZE                      equ 0001h
RXF2EIDH_EID10_LENGTH                    equ 0001h
RXF2EIDH_EID10_MASK                      equ 0004h
RXF2EIDH_EID11_POSN                      equ 0003h
RXF2EIDH_EID11_POSITION                  equ 0003h
RXF2EIDH_EID11_SIZE                      equ 0001h
RXF2EIDH_EID11_LENGTH                    equ 0001h
RXF2EIDH_EID11_MASK                      equ 0008h
RXF2EIDH_EID12_POSN                      equ 0004h
RXF2EIDH_EID12_POSITION                  equ 0004h
RXF2EIDH_EID12_SIZE                      equ 0001h
RXF2EIDH_EID12_LENGTH                    equ 0001h
RXF2EIDH_EID12_MASK                      equ 0010h
RXF2EIDH_EID13_POSN                      equ 0005h
RXF2EIDH_EID13_POSITION                  equ 0005h
RXF2EIDH_EID13_SIZE                      equ 0001h
RXF2EIDH_EID13_LENGTH                    equ 0001h
RXF2EIDH_EID13_MASK                      equ 0020h
RXF2EIDH_EID14_POSN                      equ 0006h
RXF2EIDH_EID14_POSITION                  equ 0006h
RXF2EIDH_EID14_SIZE                      equ 0001h
RXF2EIDH_EID14_LENGTH                    equ 0001h
RXF2EIDH_EID14_MASK                      equ 0040h
RXF2EIDH_EID15_POSN                      equ 0007h
RXF2EIDH_EID15_POSITION                  equ 0007h
RXF2EIDH_EID15_SIZE                      equ 0001h
RXF2EIDH_EID15_LENGTH                    equ 0001h
RXF2EIDH_EID15_MASK                      equ 0080h
RXF2EIDH_RXF2EID8_POSN                   equ 0000h
RXF2EIDH_RXF2EID8_POSITION               equ 0000h
RXF2EIDH_RXF2EID8_SIZE                   equ 0001h
RXF2EIDH_RXF2EID8_LENGTH                 equ 0001h
RXF2EIDH_RXF2EID8_MASK                   equ 0001h
RXF2EIDH_RXF2EID9_POSN                   equ 0001h
RXF2EIDH_RXF2EID9_POSITION               equ 0001h
RXF2EIDH_RXF2EID9_SIZE                   equ 0001h
RXF2EIDH_RXF2EID9_LENGTH                 equ 0001h
RXF2EIDH_RXF2EID9_MASK                   equ 0002h
RXF2EIDH_RXF2EID10_POSN                  equ 0002h
RXF2EIDH_RXF2EID10_POSITION              equ 0002h
RXF2EIDH_RXF2EID10_SIZE                  equ 0001h
RXF2EIDH_RXF2EID10_LENGTH                equ 0001h
RXF2EIDH_RXF2EID10_MASK                  equ 0004h
RXF2EIDH_RXF2EID11_POSN                  equ 0003h
RXF2EIDH_RXF2EID11_POSITION              equ 0003h
RXF2EIDH_RXF2EID11_SIZE                  equ 0001h
RXF2EIDH_RXF2EID11_LENGTH                equ 0001h
RXF2EIDH_RXF2EID11_MASK                  equ 0008h
RXF2EIDH_RXF2EID12_POSN                  equ 0004h
RXF2EIDH_RXF2EID12_POSITION              equ 0004h
RXF2EIDH_RXF2EID12_SIZE                  equ 0001h
RXF2EIDH_RXF2EID12_LENGTH                equ 0001h
RXF2EIDH_RXF2EID12_MASK                  equ 0010h
RXF2EIDH_RXF2EID13_POSN                  equ 0005h
RXF2EIDH_RXF2EID13_POSITION              equ 0005h
RXF2EIDH_RXF2EID13_SIZE                  equ 0001h
RXF2EIDH_RXF2EID13_LENGTH                equ 0001h
RXF2EIDH_RXF2EID13_MASK                  equ 0020h
RXF2EIDH_RXF2EID14_POSN                  equ 0006h
RXF2EIDH_RXF2EID14_POSITION              equ 0006h
RXF2EIDH_RXF2EID14_SIZE                  equ 0001h
RXF2EIDH_RXF2EID14_LENGTH                equ 0001h
RXF2EIDH_RXF2EID14_MASK                  equ 0040h
RXF2EIDH_RXF2EID15_POSN                  equ 0007h
RXF2EIDH_RXF2EID15_POSITION              equ 0007h
RXF2EIDH_RXF2EID15_SIZE                  equ 0001h
RXF2EIDH_RXF2EID15_LENGTH                equ 0001h
RXF2EIDH_RXF2EID15_MASK                  equ 0080h

// Register: RXF2EIDL
#define RXF2EIDL RXF2EIDL
RXF2EIDL                                 equ 0EEBh
// bitfield definitions
RXF2EIDL_EID_POSN                        equ 0000h
RXF2EIDL_EID_POSITION                    equ 0000h
RXF2EIDL_EID_SIZE                        equ 0008h
RXF2EIDL_EID_LENGTH                      equ 0008h
RXF2EIDL_EID_MASK                        equ 00FFh
RXF2EIDL_EID0_POSN                       equ 0000h
RXF2EIDL_EID0_POSITION                   equ 0000h
RXF2EIDL_EID0_SIZE                       equ 0001h
RXF2EIDL_EID0_LENGTH                     equ 0001h
RXF2EIDL_EID0_MASK                       equ 0001h
RXF2EIDL_EID1_POSN                       equ 0001h
RXF2EIDL_EID1_POSITION                   equ 0001h
RXF2EIDL_EID1_SIZE                       equ 0001h
RXF2EIDL_EID1_LENGTH                     equ 0001h
RXF2EIDL_EID1_MASK                       equ 0002h
RXF2EIDL_EID2_POSN                       equ 0002h
RXF2EIDL_EID2_POSITION                   equ 0002h
RXF2EIDL_EID2_SIZE                       equ 0001h
RXF2EIDL_EID2_LENGTH                     equ 0001h
RXF2EIDL_EID2_MASK                       equ 0004h
RXF2EIDL_EID3_POSN                       equ 0003h
RXF2EIDL_EID3_POSITION                   equ 0003h
RXF2EIDL_EID3_SIZE                       equ 0001h
RXF2EIDL_EID3_LENGTH                     equ 0001h
RXF2EIDL_EID3_MASK                       equ 0008h
RXF2EIDL_EID4_POSN                       equ 0004h
RXF2EIDL_EID4_POSITION                   equ 0004h
RXF2EIDL_EID4_SIZE                       equ 0001h
RXF2EIDL_EID4_LENGTH                     equ 0001h
RXF2EIDL_EID4_MASK                       equ 0010h
RXF2EIDL_EID5_POSN                       equ 0005h
RXF2EIDL_EID5_POSITION                   equ 0005h
RXF2EIDL_EID5_SIZE                       equ 0001h
RXF2EIDL_EID5_LENGTH                     equ 0001h
RXF2EIDL_EID5_MASK                       equ 0020h
RXF2EIDL_EID6_POSN                       equ 0006h
RXF2EIDL_EID6_POSITION                   equ 0006h
RXF2EIDL_EID6_SIZE                       equ 0001h
RXF2EIDL_EID6_LENGTH                     equ 0001h
RXF2EIDL_EID6_MASK                       equ 0040h
RXF2EIDL_EID7_POSN                       equ 0007h
RXF2EIDL_EID7_POSITION                   equ 0007h
RXF2EIDL_EID7_SIZE                       equ 0001h
RXF2EIDL_EID7_LENGTH                     equ 0001h
RXF2EIDL_EID7_MASK                       equ 0080h
RXF2EIDL_RXF2EID0_POSN                   equ 0000h
RXF2EIDL_RXF2EID0_POSITION               equ 0000h
RXF2EIDL_RXF2EID0_SIZE                   equ 0001h
RXF2EIDL_RXF2EID0_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID0_MASK                   equ 0001h
RXF2EIDL_RXF2EID1_POSN                   equ 0001h
RXF2EIDL_RXF2EID1_POSITION               equ 0001h
RXF2EIDL_RXF2EID1_SIZE                   equ 0001h
RXF2EIDL_RXF2EID1_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID1_MASK                   equ 0002h
RXF2EIDL_RXF2EID2_POSN                   equ 0002h
RXF2EIDL_RXF2EID2_POSITION               equ 0002h
RXF2EIDL_RXF2EID2_SIZE                   equ 0001h
RXF2EIDL_RXF2EID2_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID2_MASK                   equ 0004h
RXF2EIDL_RXF2EID3_POSN                   equ 0003h
RXF2EIDL_RXF2EID3_POSITION               equ 0003h
RXF2EIDL_RXF2EID3_SIZE                   equ 0001h
RXF2EIDL_RXF2EID3_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID3_MASK                   equ 0008h
RXF2EIDL_RXF2EID4_POSN                   equ 0004h
RXF2EIDL_RXF2EID4_POSITION               equ 0004h
RXF2EIDL_RXF2EID4_SIZE                   equ 0001h
RXF2EIDL_RXF2EID4_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID4_MASK                   equ 0010h
RXF2EIDL_RXF2EID5_POSN                   equ 0005h
RXF2EIDL_RXF2EID5_POSITION               equ 0005h
RXF2EIDL_RXF2EID5_SIZE                   equ 0001h
RXF2EIDL_RXF2EID5_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID5_MASK                   equ 0020h
RXF2EIDL_RXF2EID6_POSN                   equ 0006h
RXF2EIDL_RXF2EID6_POSITION               equ 0006h
RXF2EIDL_RXF2EID6_SIZE                   equ 0001h
RXF2EIDL_RXF2EID6_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID6_MASK                   equ 0040h
RXF2EIDL_RXF2EID7_POSN                   equ 0007h
RXF2EIDL_RXF2EID7_POSITION               equ 0007h
RXF2EIDL_RXF2EID7_SIZE                   equ 0001h
RXF2EIDL_RXF2EID7_LENGTH                 equ 0001h
RXF2EIDL_RXF2EID7_MASK                   equ 0080h

