GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
// Register: RXB0D4
#define RXB0D4 RXB0D4
RXB0D4                                   equ 0F6Ah
// bitfield definitions
RXB0D4_RXB0D4_POSN                       equ 0000h
RXB0D4_RXB0D4_POSITION                   equ 0000h
RXB0D4_RXB0D4_SIZE                       equ 0008h
RXB0D4_RXB0D4_LENGTH                     equ 0008h
RXB0D4_RXB0D4_MASK                       equ 00FFh
RXB0D4_RXB0D40_POSN                      equ 0000h
RXB0D4_RXB0D40_POSITION                  equ 0000h
RXB0D4_RXB0D40_SIZE                      equ 0001h
RXB0D4_RXB0D40_LENGTH                    equ 0001h
RXB0D4_RXB0D40_MASK                      equ 0001h
RXB0D4_RXB0D41_POSN                      equ 0001h
RXB0D4_RXB0D41_POSITION                  equ 0001h
RXB0D4_RXB0D41_SIZE                      equ 0001h
RXB0D4_RXB0D41_LENGTH                    equ 0001h
RXB0D4_RXB0D41_MASK                      equ 0002h
RXB0D4_RXB0D42_POSN                      equ 0002h
RXB0D4_RXB0D42_POSITION                  equ 0002h
RXB0D4_RXB0D42_SIZE                      equ 0001h
RXB0D4_RXB0D42_LENGTH                    equ 0001h
RXB0D4_RXB0D42_MASK                      equ 0004h
RXB0D4_RXB0D43_POSN                      equ 0003h
RXB0D4_RXB0D43_POSITION                  equ 0003h
RXB0D4_RXB0D43_SIZE                      equ 0001h
RXB0D4_RXB0D43_LENGTH                    equ 0001h
RXB0D4_RXB0D43_MASK                      equ 0008h
RXB0D4_RXB0D44_POSN                      equ 0004h
RXB0D4_RXB0D44_POSITION                  equ 0004h
RXB0D4_RXB0D44_SIZE                      equ 0001h
RXB0D4_RXB0D44_LENGTH                    equ 0001h
RXB0D4_RXB0D44_MASK                      equ 0010h
RXB0D4_RXB0D45_POSN                      equ 0005h
RXB0D4_RXB0D45_POSITION                  equ 0005h
RXB0D4_RXB0D45_SIZE                      equ 0001h
RXB0D4_RXB0D45_LENGTH                    equ 0001h
RXB0D4_RXB0D45_MASK                      equ 0020h
RXB0D4_RXB0D46_POSN                      equ 0006h
RXB0D4_RXB0D46_POSITION                  equ 0006h
RXB0D4_RXB0D46_SIZE                      equ 0001h
RXB0D4_RXB0D46_LENGTH                    equ 0001h
RXB0D4_RXB0D46_MASK                      equ 0040h
RXB0D4_RXB0D47_POSN                      equ 0007h
RXB0D4_RXB0D47_POSITION                  equ 0007h
RXB0D4_RXB0D47_SIZE                      equ 0001h
RXB0D4_RXB0D47_LENGTH                    equ 0001h
RXB0D4_RXB0D47_MASK                      equ 0080h

// Register: RXB0D5
#define RXB0D5 RXB0D5
RXB0D5                                   equ 0F6Bh
// bitfield definitions
RXB0D5_RXB0D5_POSN                       equ 0000h
RXB0D5_RXB0D5_POSITION                   equ 0000h
RXB0D5_RXB0D5_SIZE                       equ 0008h
RXB0D5_RXB0D5_LENGTH                     equ 0008h
RXB0D5_RXB0D5_MASK                       equ 00FFh
RXB0D5_RXB0D50_POSN                      equ 0000h
RXB0D5_RXB0D50_POSITION                  equ 0000h
RXB0D5_RXB0D50_SIZE                      equ 0001h
RXB0D5_RXB0D50_LENGTH                    equ 0001h
RXB0D5_RXB0D50_MASK                      equ 0001h
RXB0D5_RXB0D51_POSN                      equ 0001h
RXB0D5_RXB0D51_POSITION                  equ 0001h
RXB0D5_RXB0D51_SIZE                      equ 0001h
RXB0D5_RXB0D51_LENGTH                    equ 0001h
RXB0D5_RXB0D51_MASK                      equ 0002h
RXB0D5_RXB0D52_POSN                      equ 0002h
RXB0D5_RXB0D52_POSITION                  equ 0002h
RXB0D5_RXB0D52_SIZE                      equ 0001h
RXB0D5_RXB0D52_LENGTH                    equ 0001h
RXB0D5_RXB0D52_MASK                      equ 0004h
RXB0D5_RXB0D53_POSN                      equ 0003h
RXB0D5_RXB0D53_POSITION                  equ 0003h
RXB0D5_RXB0D53_SIZE                      equ 0001h
RXB0D5_RXB0D53_LENGTH                    equ 0001h
RXB0D5_RXB0D53_MASK                      equ 0008h
RXB0D5_RXB0D54_POSN                      equ 0004h
RXB0D5_RXB0D54_POSITION                  equ 0004h
RXB0D5_RXB0D54_SIZE                      equ 0001h
RXB0D5_RXB0D54_LENGTH                    equ 0001h
RXB0D5_RXB0D54_MASK                      equ 0010h
RXB0D5_RXB0D55_POSN                      equ 0005h
RXB0D5_RXB0D55_POSITION                  equ 0005h
RXB0D5_RXB0D55_SIZE                      equ 0001h
RXB0D5_RXB0D55_LENGTH                    equ 0001h
RXB0D5_RXB0D55_MASK                      equ 0020h
RXB0D5_RXB0D56_POSN                      equ 0006h
RXB0D5_RXB0D56_POSITION                  equ 0006h
RXB0D5_RXB0D56_SIZE                      equ 0001h
RXB0D5_RXB0D56_LENGTH                    equ 0001h
RXB0D5_RXB0D56_MASK                      equ 0040h
RXB0D5_RXB0D57_POSN                      equ 0007h
RXB0D5_RXB0D57_POSITION                  equ 0007h
RXB0D5_RXB0D57_SIZE                      equ 0001h
RXB0D5_RXB0D57_LENGTH                    equ 0001h
RXB0D5_RXB0D57_MASK                      equ 0080h

// Register: RXB0D6
#define RXB0D6 RXB0D6
RXB0D6                                   equ 0F6Ch
// bitfield definitions
RXB0D6_RXB0D6_POSN                       equ 0000h
RXB0D6_RXB0D6_POSITION                   equ 0000h
RXB0D6_RXB0D6_SIZE                       equ 0008h
RXB0D6_RXB0D6_LENGTH                     equ 0008h
RXB0D6_RXB0D6_MASK                       equ 00FFh
RXB0D6_RXB0D60_POSN                      equ 0000h
RXB0D6_RXB0D60_POSITION                  equ 0000h
RXB0D6_RXB0D60_SIZE                      equ 0001h
RXB0D6_RXB0D60_LENGTH                    equ 0001h
RXB0D6_RXB0D60_MASK                      equ 0001h
RXB0D6_RXB0D61_POSN                      equ 0001h
RXB0D6_RXB0D61_POSITION                  equ 0001h
RXB0D6_RXB0D61_SIZE                      equ 0001h
RXB0D6_RXB0D61_LENGTH                    equ 0001h
RXB0D6_RXB0D61_MASK                      equ 0002h
RXB0D6_RXB0D62_POSN                      equ 0002h
RXB0D6_RXB0D62_POSITION                  equ 0002h
RXB0D6_RXB0D62_SIZE                      equ 0001h
RXB0D6_RXB0D62_LENGTH                    equ 0001h
RXB0D6_RXB0D62_MASK                      equ 0004h
RXB0D6_RXB0D63_POSN                      equ 0003h
RXB0D6_RXB0D63_POSITION                  equ 0003h
RXB0D6_RXB0D63_SIZE                      equ 0001h
RXB0D6_RXB0D63_LENGTH                    equ 0001h
RXB0D6_RXB0D63_MASK                      equ 0008h
RXB0D6_RXB0D64_POSN                      equ 0004h
RXB0D6_RXB0D64_POSITION                  equ 0004h
RXB0D6_RXB0D64_SIZE                      equ 0001h
RXB0D6_RXB0D64_LENGTH                    equ 0001h
RXB0D6_RXB0D64_MASK                      equ 0010h
RXB0D6_RXB0D65_POSN                      equ 0005h
RXB0D6_RXB0D65_POSITION                  equ 0005h
RXB0D6_RXB0D65_SIZE                      equ 0001h
RXB0D6_RXB0D65_LENGTH                    equ 0001h
RXB0D6_RXB0D65_MASK                      equ 0020h
RXB0D6_RXB0D66_POSN                      equ 0006h
RXB0D6_RXB0D66_POSITION                  equ 0006h
RXB0D6_RXB0D66_SIZE                      equ 0001h
RXB0D6_RXB0D66_LENGTH                    equ 0001h
RXB0D6_RXB0D66_MASK                      equ 0040h
RXB0D6_RXB0D67_POSN                      equ 0007h
RXB0D6_RXB0D67_POSITION                  equ 0007h
RXB0D6_RXB0D67_SIZE                      equ 0001h
RXB0D6_RXB0D67_LENGTH                    equ 0001h
RXB0D6_RXB0D67_MASK                      equ 0080h

// Register: RXB0D7
#define RXB0D7 RXB0D7
RXB0D7                                   equ 0F6Dh
// bitfield definitions
RXB0D7_RXB0D7_POSN                       equ 0000h
RXB0D7_RXB0D7_POSITION                   equ 0000h
RXB0D7_RXB0D7_SIZE                       equ 0008h
RXB0D7_RXB0D7_LENGTH                     equ 0008h
RXB0D7_RXB0D7_MASK                       equ 00FFh
RXB0D7_RXB0D70_POSN                      equ 0000h
RXB0D7_RXB0D70_POSITION                  equ 0000h
RXB0D7_RXB0D70_SIZE                      equ 0001h
RXB0D7_RXB0D70_LENGTH                    equ 0001h
RXB0D7_RXB0D70_MASK                      equ 0001h
RXB0D7_RXB0D71_POSN                      equ 0001h
RXB0D7_RXB0D71_POSITION                  equ 0001h
RXB0D7_RXB0D71_SIZE                      equ 0001h
RXB0D7_RXB0D71_LENGTH                    equ 0001h
RXB0D7_RXB0D71_MASK                      equ 0002h
RXB0D7_RXB0D72_POSN                      equ 0002h
RXB0D7_RXB0D72_POSITION                  equ 0002h
RXB0D7_RXB0D72_SIZE                      equ 0001h
RXB0D7_RXB0D72_LENGTH                    equ 0001h
RXB0D7_RXB0D72_MASK                      equ 0004h
RXB0D7_RXB0D73_POSN                      equ 0003h
RXB0D7_RXB0D73_POSITION                  equ 0003h
RXB0D7_RXB0D73_SIZE                      equ 0001h
RXB0D7_RXB0D73_LENGTH                    equ 0001h
RXB0D7_RXB0D73_MASK                      equ 0008h
RXB0D7_RXB0D74_POSN                      equ 0004h
RXB0D7_RXB0D74_POSITION                  equ 0004h
RXB0D7_RXB0D74_SIZE                      equ 0001h
RXB0D7_RXB0D74_LENGTH                    equ 0001h
RXB0D7_RXB0D74_MASK                      equ 0010h
RXB0D7_RXB0D75_POSN                      equ 0005h
RXB0D7_RXB0D75_POSITION                  equ 0005h
RXB0D7_RXB0D75_SIZE                      equ 0001h
RXB0D7_RXB0D75_LENGTH                    equ 0001h
RXB0D7_RXB0D75_MASK                      equ 0020h
RXB0D7_RXB0D76_POSN                      equ 0006h
RXB0D7_RXB0D76_POSITION                  equ 0006h
RXB0D7_RXB0D76_SIZE                      equ 0001h
RXB0D7_RXB0D76_LENGTH                    equ 0001h
RXB0D7_RXB0D76_MASK                      equ 0040h
RXB0D7_RXB0D77_POSN                      equ 0007h
RXB0D7_RXB0D77_POSITION                  equ 0007h
RXB0D7_RXB0D77_SIZE                      equ 0001h
RXB0D7_RXB0D77_LENGTH                    equ 0001h
RXB0D7_RXB0D77_MASK                      equ 0080h

// Register: CANSTAT
#define CANSTAT CANSTAT
CANSTAT                                  equ 0F6Eh
// bitfield definitions
CANSTAT_EICODE0_POSN                     equ 0000h
CANSTAT_EICODE0_POSITION                 equ 0000h
CANSTAT_EICODE0_SIZE                     equ 0001h
CANSTAT_EICODE0_LENGTH                   equ 0001h
CANSTAT_EICODE0_MASK                     equ 0001h
CANSTAT_EICODE1_ICODE0_POSN              equ 0001h
CANSTAT_EICODE1_ICODE0_POSITION          equ 0001h
CANSTAT_EICODE1_ICODE0_SIZE              equ 0001h
CANSTAT_EICODE1_ICODE0_LENGTH            equ 0001h
CANSTAT_EICODE1_ICODE0_MASK              equ 0002h
CANSTAT_EICODE2_ICODE1_POSN              equ 0002h
CANSTAT_EICODE2_ICODE1_POSITION          equ 0002h
CANSTAT_EICODE2_ICODE1_SIZE              equ 0001h
CANSTAT_EICODE2_ICODE1_LENGTH            equ 0001h
CANSTAT_EICODE2_ICODE1_MASK              equ 0004h
CANSTAT_EICODE3_ICODE2_POSN              equ 0003h
CANSTAT_EICODE3_ICODE2_POSITION          equ 0003h
CANSTAT_EICODE3_ICODE2_SIZE              equ 0001h
CANSTAT_EICODE3_ICODE2_LENGTH            equ 0001h
CANSTAT_EICODE3_ICODE2_MASK              equ 0008h
CANSTAT_EICODE4_POSN                     equ 0004h
CANSTAT_EICODE4_POSITION                 equ 0004h
CANSTAT_EICODE4_SIZE                     equ 0001h
CANSTAT_EICODE4_LENGTH                   equ 0001h
CANSTAT_EICODE4_MASK                     equ 0010h
CANSTAT_OPMODE_POSN                      equ 0005h
CANSTAT_OPMODE_POSITION                  equ 0005h
CANSTAT_OPMODE_SIZE                      equ 0003h
CANSTAT_OPMODE_LENGTH                    equ 0003h
CANSTAT_OPMODE_MASK                      equ 00E0h
CANSTAT_EICODE1_POSN                     equ 0001h
CANSTAT_EICODE1_POSITION                 equ 0001h
CANSTAT_EICODE1_SIZE                     equ 0001h
CANSTAT_EICODE1_LENGTH                   equ 0001h
CANSTAT_EICODE1_MASK                     equ 0002h
CANSTAT_EICODE2_POSN                     equ 0002h
CANSTAT_EICODE2_POSITION                 equ 0002h
CANSTAT_EICODE2_SIZE                     equ 0001h
CANSTAT_EICODE2_LENGTH                   equ 0001h
CANSTAT_EICODE2_MASK                     equ 0004h
CANSTAT_EICODE3_POSN                     equ 0003h
CANSTAT_EICODE3_POSITION                 equ 0003h
CANSTAT_EICODE3_SIZE                     equ 0001h
CANSTAT_EICODE3_LENGTH                   equ 0001h
CANSTAT_EICODE3_MASK                     equ 0008h
CANSTAT_OPMODE0_POSN                     equ 0005h
CANSTAT_OPMODE0_POSITION                 equ 0005h
CANSTAT_OPMODE0_SIZE                     equ 0001h
CANSTAT_OPMODE0_LENGTH                   equ 0001h
CANSTAT_OPMODE0_MASK                     equ 0020h
CANSTAT_OPMODE1_POSN                     equ 0006h
CANSTAT_OPMODE1_POSITION                 equ 0006h
CANSTAT_OPMODE1_SIZE                     equ 0001h
CANSTAT_OPMODE1_LENGTH                   equ 0001h
CANSTAT_OPMODE1_MASK                     equ 0040h
CANSTAT_OPMODE2_POSN                     equ 0007h
CANSTAT_OPMODE2_POSITION                 equ 0007h
CANSTAT_OPMODE2_SIZE                     equ 0001h
CANSTAT_OPMODE2_LENGTH                   equ 0001h
CANSTAT_OPMODE2_MASK                     equ 0080h
CANSTAT_ICODE0_POSN                      equ 0001h
CANSTAT_ICODE0_POSITION                  equ 0001h
CANSTAT_ICODE0_SIZE                      equ 0001h
CANSTAT_ICODE0_LENGTH                    equ 0001h
CANSTAT_ICODE0_MASK                      equ 0002h
CANSTAT_ICODE1_POSN                      equ 0002h
CANSTAT_ICODE1_POSITION                  equ 0002h
CANSTAT_ICODE1_SIZE                      equ 0001h
CANSTAT_ICODE1_LENGTH                    equ 0001h
CANSTAT_ICODE1_MASK                      equ 0004h
CANSTAT_ICODE2_POSN                      equ 0003h
CANSTAT_ICODE2_POSITION                  equ 0003h
CANSTAT_ICODE2_SIZE                      equ 0001h
CANSTAT_ICODE2_LENGTH                    equ 0001h
CANSTAT_ICODE2_MASK                      equ 0008h

// Register: CANCON
#define CANCON CANCON
CANCON                                   equ 0F6Fh
// bitfield definitions
CANCON_FP0_POSN                          equ 0000h
CANCON_FP0_POSITION                      equ 0000h
CANCON_FP0_SIZE                          equ 0001h
CANCON_FP0_LENGTH                        equ 0001h
CANCON_FP0_MASK                          equ 0001h
CANCON_WIN0_FP1_POSN                     equ 0001h
CANCON_WIN0_FP1_POSITION                 equ 0001h
CANCON_WIN0_FP1_SIZE                     equ 0001h
CANCON_WIN0_FP1_LENGTH                   equ 0001h
CANCON_WIN0_FP1_MASK                     equ 0002h
CANCON_WIN1_FP2_POSN                     equ 0002h
CANCON_WIN1_FP2_POSITION                 equ 0002h
CANCON_WIN1_FP2_SIZE                     equ 0001h
CANCON_WIN1_FP2_LENGTH                   equ 0001h
CANCON_WIN1_FP2_MASK                     equ 0004h
CANCON_WIN2_FP3_POSN                     equ 0003h
CANCON_WIN2_FP3_POSITION                 equ 0003h
CANCON_WIN2_FP3_SIZE                     equ 0001h
CANCON_WIN2_FP3_LENGTH                   equ 0001h
CANCON_WIN2_FP3_MASK                     equ 0008h
CANCON_ABAT_POSN                         equ 0004h
CANCON_ABAT_POSITION                     equ 0004h
CANCON_ABAT_SIZE                         equ 0001h
CANCON_ABAT_LENGTH                       equ 0001h
CANCON_ABAT_MASK                         equ 0010h
CANCON_REQOP_POSN                        equ 0005h
CANCON_REQOP_POSITION                    equ 0005h
CANCON_REQOP_SIZE                        equ 0003h
CANCON_REQOP_LENGTH                      equ 0003h
CANCON_REQOP_MASK                        equ 00E0h
CANCON_WIN0_POSN                         equ 0001h
CANCON_WIN0_POSITION                     equ 0001h
CANCON_WIN0_SIZE                         equ 0001h
CANCON_WIN0_LENGTH                       equ 0001h
CANCON_WIN0_MASK                         equ 0002h
CANCON_WIN1_POSN                         equ 0002h
CANCON_WIN1_POSITION                     equ 0002h
CANCON_WIN1_SIZE                         equ 0001h
CANCON_WIN1_LENGTH                       equ 0001h
CANCON_WIN1_MASK                         equ 0004h
CANCON_WIN2_POSN                         equ 0003h
CANCON_WIN2_POSITION                     equ 0003h
CANCON_WIN2_SIZE                         equ 0001h
CANCON_WIN2_LENGTH                       equ 0001h
CANCON_WIN2_MASK                         equ 0008h
CANCON_FP1_POSN                          equ 0001h
CANCON_FP1_POSITION                      equ 0001h
CANCON_FP1_SIZE                          equ 0001h
CANCON_FP1_LENGTH                        equ 0001h
CANCON_FP1_MASK                          equ 0002h
CANCON_FP2_POSN                          equ 0002h
CANCON_FP2_POSITION                      equ 0002h
CANCON_FP2_SIZE                          equ 0001h
CANCON_FP2_LENGTH                        equ 0001h
CANCON_FP2_MASK                          equ 0004h
CANCON_FP3_POSN                          equ 0003h
CANCON_FP3_POSITION                      equ 0003h
CANCON_FP3_SIZE                          equ 0001h
CANCON_FP3_LENGTH                        equ 0001h
CANCON_FP3_MASK                          equ 0008h

// Register: CIOCON
#define CIOCON CIOCON
CIOCON                                   equ 0F70h
// bitfield definitions
CIOCON_CLKSEL_POSN                       equ 0000h
CIOCON_CLKSEL_POSITION                   equ 0000h
CIOCON_CLKSEL_SIZE                       equ 0001h
CIOCON_CLKSEL_LENGTH                     equ 0001h
CIOCON_CLKSEL_MASK                       equ 0001h
CIOCON_CANCAP_POSN                       equ 0004h
CIOCON_CANCAP_POSITION                   equ 0004h
CIOCON_CANCAP_SIZE                       equ 0001h
CIOCON_CANCAP_LENGTH                     equ 0001h
CIOCON_CANCAP_MASK                       equ 0010h
CIOCON_ENDRHI_POSN                       equ 0005h
CIOCON_ENDRHI_POSITION                   equ 0005h
CIOCON_ENDRHI_SIZE                       equ 0001h
CIOCON_ENDRHI_LENGTH                     equ 0001h
CIOCON_ENDRHI_MASK                       equ 0020h
CIOCON_TX2EN_POSN                        equ 0006h
CIOCON_TX2EN_POSITION                    equ 0006h
CIOCON_TX2EN_SIZE                        equ 0001h
CIOCON_TX2EN_LENGTH                      equ 0001h
CIOCON_TX2EN_MASK                        equ 0040h
CIOCON_TX2SRC_POSN                       equ 0007h
CIOCON_TX2SRC_POSITION                   equ 0007h
CIOCON_TX2SRC_SIZE                       equ 0001h
CIOCON_TX2SRC_LENGTH                     equ 0001h
CIOCON_TX2SRC_MASK                       equ 0080h

// Register: COMSTAT
#define COMSTAT COMSTAT
COMSTAT                                  equ 0F71h
// bitfield definitions
COMSTAT_EWARN_POSN                       equ 0000h
COMSTAT_EWARN_POSITION                   equ 0000h
COMSTAT_EWARN_SIZE                       equ 0001h
COMSTAT_EWARN_LENGTH                     equ 0001h
COMSTAT_EWARN_MASK                       equ 0001h
COMSTAT_RXWARN_POSN                      equ 0001h
COMSTAT_RXWARN_POSITION                  equ 0001h
COMSTAT_RXWARN_SIZE                      equ 0001h
COMSTAT_RXWARN_LENGTH                    equ 0001h
COMSTAT_RXWARN_MASK                      equ 0002h
COMSTAT_TXWARN_POSN                      equ 0002h
COMSTAT_TXWARN_POSITION                  equ 0002h
COMSTAT_TXWARN_SIZE                      equ 0001h
COMSTAT_TXWARN_LENGTH                    equ 0001h
COMSTAT_TXWARN_MASK                      equ 0004h
COMSTAT_RXBP_POSN                        equ 0003h
COMSTAT_RXBP_POSITION                    equ 0003h
COMSTAT_RXBP_SIZE                        equ 0001h
COMSTAT_RXBP_LENGTH                      equ 0001h
COMSTAT_RXBP_MASK                        equ 0008h
COMSTAT_TXBP_POSN                        equ 0004h
COMSTAT_TXBP_POSITION                    equ 0004h
COMSTAT_TXBP_SIZE                        equ 0001h
COMSTAT_TXBP_LENGTH                      equ 0001h
COMSTAT_TXBP_MASK                        equ 0010h
COMSTAT_TXBO_POSN                        equ 0005h
COMSTAT_TXBO_POSITION                    equ 0005h
COMSTAT_TXBO_SIZE                        equ 0001h
COMSTAT_TXBO_LENGTH                      equ 0001h
COMSTAT_TXBO_MASK                        equ 0020h
COMSTAT_RXB1OVFL_POSN                    equ 0006h
COMSTAT_RXB1OVFL_POSITION                equ 0006h
COMSTAT_RXB1OVFL_SIZE                    equ 0001h
COMSTAT_RXB1OVFL_LENGTH                  equ 0001h
COMSTAT_RXB1OVFL_MASK                    equ 0040h
COMSTAT_RXB0OVFL_POSN                    equ 0007h
COMSTAT_RXB0OVFL_POSITION                equ 0007h
COMSTAT_RXB0OVFL_SIZE                    equ 0001h
COMSTAT_RXB0OVFL_LENGTH                  equ 0001h
COMSTAT_RXB0OVFL_MASK                    equ 0080h
COMSTAT_NOT_FIFOEMPTY_POSN               equ 0007h
COMSTAT_NOT_FIFOEMPTY_POSITION           equ 0007h
COMSTAT_NOT_FIFOEMPTY_SIZE               equ 0001h
COMSTAT_NOT_FIFOEMPTY_LENGTH             equ 0001h
COMSTAT_NOT_FIFOEMPTY_MASK               equ 0080h
COMSTAT_nFIFOEMPTY_POSN                  equ 0007h
COMSTAT_nFIFOEMPTY_POSITION              equ 0007h
COMSTAT_nFIFOEMPTY_SIZE                  equ 0001h
COMSTAT_nFIFOEMPTY_LENGTH                equ 0001h
COMSTAT_nFIFOEMPTY_MASK                  equ 0080h
COMSTAT_RXBNOVFL_POSN                    equ 0006h
COMSTAT_RXBNOVFL_POSITION                equ 0006h
COMSTAT_RXBNOVFL_SIZE                    equ 0001h
COMSTAT_RXBNOVFL_LENGTH                  equ 0001h
COMSTAT_RXBNOVFL_MASK                    equ 0040h
COMSTAT_FIFOEMPTY_POSN                   equ 0007h
COMSTAT_FIFOEMPTY_POSITION               equ 0007h
COMSTAT_FIFOEMPTY_SIZE                   equ 0001h
COMSTAT_FIFOEMPTY_LENGTH                 equ 0001h
COMSTAT_FIFOEMPTY_MASK                   equ 0080h

