GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
// Register: SLRCON
#define SLRCON SLRCON
SLRCON                                   equ 0F90h
// bitfield definitions
SLRCON_SLRA_POSN                         equ 0000h
SLRCON_SLRA_POSITION                     equ 0000h
SLRCON_SLRA_SIZE                         equ 0001h
SLRCON_SLRA_LENGTH                       equ 0001h
SLRCON_SLRA_MASK                         equ 0001h
SLRCON_SLRB_POSN                         equ 0001h
SLRCON_SLRB_POSITION                     equ 0001h
SLRCON_SLRB_SIZE                         equ 0001h
SLRCON_SLRB_LENGTH                       equ 0001h
SLRCON_SLRB_MASK                         equ 0002h
SLRCON_SLRC_POSN                         equ 0002h
SLRCON_SLRC_POSITION                     equ 0002h
SLRCON_SLRC_SIZE                         equ 0001h
SLRCON_SLRC_LENGTH                       equ 0001h
SLRCON_SLRC_MASK                         equ 0004h
SLRCON_SLRD_POSN                         equ 0003h
SLRCON_SLRD_POSITION                     equ 0003h
SLRCON_SLRD_SIZE                         equ 0001h
SLRCON_SLRD_LENGTH                       equ 0001h
SLRCON_SLRD_MASK                         equ 0008h
SLRCON_SLRE_POSN                         equ 0004h
SLRCON_SLRE_POSITION                     equ 0004h
SLRCON_SLRE_SIZE                         equ 0001h
SLRCON_SLRE_LENGTH                       equ 0001h
SLRCON_SLRE_MASK                         equ 0010h
SLRCON_SLRF_POSN                         equ 0005h
SLRCON_SLRF_POSITION                     equ 0005h
SLRCON_SLRF_SIZE                         equ 0001h
SLRCON_SLRF_LENGTH                       equ 0001h
SLRCON_SLRF_MASK                         equ 0020h
SLRCON_SLRG_POSN                         equ 0006h
SLRCON_SLRG_POSITION                     equ 0006h
SLRCON_SLRG_SIZE                         equ 0001h
SLRCON_SLRG_LENGTH                       equ 0001h
SLRCON_SLRG_MASK                         equ 0040h

// Register: ODCON
#define ODCON ODCON
ODCON                                    equ 0F91h
// bitfield definitions
ODCON_U1OD_POSN                          equ 0000h
ODCON_U1OD_POSITION                      equ 0000h
ODCON_U1OD_SIZE                          equ 0001h
ODCON_U1OD_LENGTH                        equ 0001h
ODCON_U1OD_MASK                          equ 0001h
ODCON_U2OD_POSN                          equ 0001h
ODCON_U2OD_POSITION                      equ 0001h
ODCON_U2OD_SIZE                          equ 0001h
ODCON_U2OD_LENGTH                        equ 0001h
ODCON_U2OD_MASK                          equ 0002h
ODCON_CCP1OD_POSN                        equ 0002h
ODCON_CCP1OD_POSITION                    equ 0002h
ODCON_CCP1OD_SIZE                        equ 0001h
ODCON_CCP1OD_LENGTH                      equ 0001h
ODCON_CCP1OD_MASK                        equ 0004h
ODCON_CCP2OD_POSN                        equ 0003h
ODCON_CCP2OD_POSITION                    equ 0003h
ODCON_CCP2OD_SIZE                        equ 0001h
ODCON_CCP2OD_LENGTH                      equ 0001h
ODCON_CCP2OD_MASK                        equ 0008h
ODCON_CCP3OD_POSN                        equ 0004h
ODCON_CCP3OD_POSITION                    equ 0004h
ODCON_CCP3OD_SIZE                        equ 0001h
ODCON_CCP3OD_LENGTH                      equ 0001h
ODCON_CCP3OD_MASK                        equ 0010h
ODCON_CCP4OD_POSN                        equ 0005h
ODCON_CCP4OD_POSITION                    equ 0005h
ODCON_CCP4OD_SIZE                        equ 0001h
ODCON_CCP4OD_LENGTH                      equ 0001h
ODCON_CCP4OD_MASK                        equ 0020h
ODCON_CCP5OD_POSN                        equ 0006h
ODCON_CCP5OD_POSITION                    equ 0006h
ODCON_CCP5OD_SIZE                        equ 0001h
ODCON_CCP5OD_LENGTH                      equ 0001h
ODCON_CCP5OD_MASK                        equ 0040h
ODCON_SSPOD_POSN                         equ 0007h
ODCON_SSPOD_POSITION                     equ 0007h
ODCON_SSPOD_SIZE                         equ 0001h
ODCON_SSPOD_LENGTH                       equ 0001h
ODCON_SSPOD_MASK                         equ 0080h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 0F92h
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA3_POSN                        equ 0003h
TRISA_TRISA3_POSITION                    equ 0003h
TRISA_TRISA3_SIZE                        equ 0001h
TRISA_TRISA3_LENGTH                      equ 0001h
TRISA_TRISA3_MASK                        equ 0008h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h
TRISA_TRISA6_POSN                        equ 0006h
TRISA_TRISA6_POSITION                    equ 0006h
TRISA_TRISA6_SIZE                        equ 0001h
TRISA_TRISA6_LENGTH                      equ 0001h
TRISA_TRISA6_MASK                        equ 0040h
TRISA_TRISA7_POSN                        equ 0007h
TRISA_TRISA7_POSITION                    equ 0007h
TRISA_TRISA7_SIZE                        equ 0001h
TRISA_TRISA7_LENGTH                      equ 0001h
TRISA_TRISA7_MASK                        equ 0080h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 0F93h
// bitfield definitions
TRISB_TRISB0_POSN                        equ 0000h
TRISB_TRISB0_POSITION                    equ 0000h
TRISB_TRISB0_SIZE                        equ 0001h
TRISB_TRISB0_LENGTH                      equ 0001h
TRISB_TRISB0_MASK                        equ 0001h
TRISB_TRISB1_POSN                        equ 0001h
TRISB_TRISB1_POSITION                    equ 0001h
TRISB_TRISB1_SIZE                        equ 0001h
TRISB_TRISB1_LENGTH                      equ 0001h
TRISB_TRISB1_MASK                        equ 0002h
TRISB_TRISB2_POSN                        equ 0002h
TRISB_TRISB2_POSITION                    equ 0002h
TRISB_TRISB2_SIZE                        equ 0001h
TRISB_TRISB2_LENGTH                      equ 0001h
TRISB_TRISB2_MASK                        equ 0004h
TRISB_TRISB3_POSN                        equ 0003h
TRISB_TRISB3_POSITION                    equ 0003h
TRISB_TRISB3_SIZE                        equ 0001h
TRISB_TRISB3_LENGTH                      equ 0001h
TRISB_TRISB3_MASK                        equ 0008h
TRISB_TRISB4_POSN                        equ 0004h
TRISB_TRISB4_POSITION                    equ 0004h
TRISB_TRISB4_SIZE                        equ 0001h
TRISB_TRISB4_LENGTH                      equ 0001h
TRISB_TRISB4_MASK                        equ 0010h
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 0F94h
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC2_POSN                        equ 0002h
TRISC_TRISC2_POSITION                    equ 0002h
TRISC_TRISC2_SIZE                        equ 0001h
TRISC_TRISC2_LENGTH                      equ 0001h
TRISC_TRISC2_MASK                        equ 0004h
TRISC_TRISC3_POSN                        equ 0003h
TRISC_TRISC3_POSITION                    equ 0003h
TRISC_TRISC3_SIZE                        equ 0001h
TRISC_TRISC3_LENGTH                      equ 0001h
TRISC_TRISC3_MASK                        equ 0008h
TRISC_TRISC4_POSN                        equ 0004h
TRISC_TRISC4_POSITION                    equ 0004h
TRISC_TRISC4_SIZE                        equ 0001h
TRISC_TRISC4_LENGTH                      equ 0001h
TRISC_TRISC4_MASK                        equ 0010h
TRISC_TRISC5_POSN                        equ 0005h
TRISC_TRISC5_POSITION                    equ 0005h
TRISC_TRISC5_SIZE                        equ 0001h
TRISC_TRISC5_LENGTH                      equ 0001h
TRISC_TRISC5_MASK                        equ 0020h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h

