GopalSaraf/Practicals/PSDL/include/proc/pic18f65k80.inc
#define FERR2                            BANKMASK(RCSTA2), 2, a
#define FIFOEMPTY                        BANKMASK(COMSTAT), 7, a
#define FIFOWM                           BANKMASK(ECANCON), 5, a
#define FIFOWMIE                         BANKMASK(PIE5), 0, a
#define FIFOWMIF                         BANKMASK(PIR5), 0, a
#define FIFOWMIP                         BANKMASK(IPR5), 0, a
#define FIL0_0                           BANKMASK(MSEL0), 0, b
#define FIL0_1                           BANKMASK(MSEL0), 1, b
#define FIL10_0                          BANKMASK(MSEL2), 4, b
#define FIL10_1                          BANKMASK(MSEL2), 5, b
#define FIL11_0                          BANKMASK(MSEL2), 6, b
#define FIL11_1                          BANKMASK(MSEL2), 7, b
#define FIL12_0                          BANKMASK(MSEL3), 0, b
#define FIL12_1                          BANKMASK(MSEL3), 1, b
#define FIL13_0                          BANKMASK(MSEL3), 2, b
#define FIL13_1                          BANKMASK(MSEL3), 3, b
#define FIL14_0                          BANKMASK(MSEL3), 4, b
#define FIL14_1                          BANKMASK(MSEL3), 5, b
#define FIL15_0                          BANKMASK(MSEL3), 6, b
#define FIL15_1                          BANKMASK(MSEL3), 7, b
#define FIL1_0                           BANKMASK(MSEL0), 2, b
#define FIL1_1                           BANKMASK(MSEL0), 3, b
#define FIL2_0                           BANKMASK(MSEL0), 4, b
#define FIL2_1                           BANKMASK(MSEL0), 5, b
#define FIL3_0                           BANKMASK(MSEL0), 6, b
#define FIL3_1                           BANKMASK(MSEL0), 7, b
#define FIL4_0                           BANKMASK(MSEL1), 0, b
#define FIL4_1                           BANKMASK(MSEL1), 1, b
#define FIL5_0                           BANKMASK(MSEL1), 2, b
#define FIL5_1                           BANKMASK(MSEL1), 3, b
#define FIL6_0                           BANKMASK(MSEL1), 4, b
#define FIL6_1                           BANKMASK(MSEL1), 5, b
#define FIL7_0                           BANKMASK(MSEL1), 6, b
#define FIL7_1                           BANKMASK(MSEL1), 7, b
#define FIL8_0                           BANKMASK(MSEL2), 0, b
#define FIL8_1                           BANKMASK(MSEL2), 1, b
#define FIL9_0                           BANKMASK(MSEL2), 2, b
#define FIL9_1                           BANKMASK(MSEL2), 3, b
#define FLC0                             BANKMASK(SDFLC), 0, b
#define FLC1                             BANKMASK(SDFLC), 1, b
#define FLC2                             BANKMASK(SDFLC), 2, b
#define FLC3                             BANKMASK(SDFLC), 3, b
#define FLC4                             BANKMASK(SDFLC), 4, b
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN                             BANKMASK(SSPCON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFIOFS                           BANKMASK(OSCCON), 2, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSPSTAT), 5, a
#define I2C_READ                         BANKMASK(SSPSTAT), 2, a
#define I2C_START                        BANKMASK(SSPSTAT), 3, a
#define I2C_STOP                         BANKMASK(SSPSTAT), 4, a
#define IBF                              BANKMASK(PSPCON), 7, b
#define IBOV                             BANKMASK(PSPCON), 5, b
#define ICODE20                          BANKMASK(CANSTAT_RO2), 1, b
#define ICODE21                          BANKMASK(CANSTAT_RO2), 2, b
#define IDISSEN                          BANKMASK(CTMUCONH), 1, b
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INT3P                            BANKMASK(INTCON2), 1, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOCB4                            BANKMASK(IOCB), 4, b
#define IOCB5                            BANKMASK(IOCB), 5, b
#define IOCB6                            BANKMASK(IOCB), 6, b
#define IOCB7                            BANKMASK(IOCB), 7, b
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, b
#define IRNG1                            BANKMASK(CTMUICON), 1, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define IRXIE                            BANKMASK(PIE5), 7, a
#define IRXIF                            BANKMASK(PIR5), 7, a
#define IRXIP                            BANKMASK(IPR5), 7, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, b
#define ITRIM1                           BANKMASK(CTMUICON), 3, b
#define ITRIM2                           BANKMASK(CTMUICON), 4, b
#define ITRIM3                           BANKMASK(CTMUICON), 5, b
#define ITRIM4                           BANKMASK(CTMUICON), 6, b
#define ITRIM5                           BANKMASK(CTMUICON), 7, b
#define JTOFF                            BANKMASK(RXB0CON), 1, a
#define JTOFF_FILHIT1                    BANKMASK(RXB0CON), 1, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATE4                            BANKMASK(LATE), 4, a
#define LATE5                            BANKMASK(LATE), 5, a
#define LATE6                            BANKMASK(LATE), 6, a
#define LATE7                            BANKMASK(LATE), 7, a
#define LATF0                            BANKMASK(LATF), 0, a
#define LATF1                            BANKMASK(LATF), 1, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LF0                              BANKMASK(LATF), 0, a
#define LF1                              BANKMASK(LATF), 1, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
#define LG0                              BANKMASK(LATG), 0, a
#define LG1                              BANKMASK(LATG), 1, a
#define LG2                              BANKMASK(LATG), 2, a
#define LG3                              BANKMASK(LATG), 3, a
#define LG4                              BANKMASK(LATG), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(OSCCON2), 0, a
#define LVDL1                            BANKMASK(OSCCON2), 1, a
#define LVDL2                            BANKMASK(OSCCON2), 2, a
#define LVDL3                            BANKMASK(OSCCON2), 3, a
#define MDBIT                            BANKMASK(MDCON), 0, b
#define MDCH0                            BANKMASK(MDCARH), 0, b
#define MDCH1                            BANKMASK(MDCARH), 1, b
#define MDCH2                            BANKMASK(MDCARH), 2, b
#define MDCH3                            BANKMASK(MDCARH), 3, b
#define MDCHODIS                         BANKMASK(MDCARH), 7, b
#define MDCHPOL                          BANKMASK(MDCARH), 6, b
#define MDCHSYNC                         BANKMASK(MDCARH), 5, b
#define MDCL0                            BANKMASK(MDCARL), 0, b
#define MDCL1                            BANKMASK(MDCARL), 1, b
#define MDCL2                            BANKMASK(MDCARL), 2, b
#define MDCL3                            BANKMASK(MDCARL), 3, b
#define MDCLODIS                         BANKMASK(MDCARL), 7, b
#define MDCLPOL                          BANKMASK(MDCARL), 6, b
#define MDCLSYNC                         BANKMASK(MDCARL), 5, b
#define MDEN                             BANKMASK(MDCON), 7, b
#define MDO                              BANKMASK(MDCON), 3, b
#define MDOE                             BANKMASK(MDCON), 6, b
#define MDOPOL                           BANKMASK(MDCON), 4, b
#define MDSEL0                           BANKMASK(ECANCON), 6, a
#define MDSEL1                           BANKMASK(ECANCON), 7, a
#define MDSLR                            BANKMASK(MDCON), 5, b
#define MDSODIS                          BANKMASK(MDSRC), 7, b
#define MDSRC0                           BANKMASK(MDSRC), 0, b
#define MDSRC1                           BANKMASK(MDSRC), 1, b
#define MDSRC2                           BANKMASK(MDSRC), 2, b
#define MDSRC3                           BANKMASK(MDSRC), 3, b
#define MFIOFS                           BANKMASK(OSCCON2), 1, a
#define MFIOSEL                          BANKMASK(OSCCON2), 0, a
#define MODMD                            BANKMASK(PMD2), 3, b
#define MSK0                             BANKMASK(SSPADD), 0, a
#define MSK1                             BANKMASK(SSPADD), 1, a
#define MSK2                             BANKMASK(SSPADD), 2, a
#define MSK3                             BANKMASK(SSPADD), 3, a
#define MSK4                             BANKMASK(SSPADD), 4, a
#define MSK5                             BANKMASK(SSPADD), 5, a
#define MSK6                             BANKMASK(SSPADD), 6, a
#define MSK7                             BANKMASK(SSPADD), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_FIFOEMPTY                    BANKMASK(COMSTAT), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RC8                          BANKMASK(RCSTA1), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_TX8                          BANKMASK(TXSTA1), 6, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OBF                              BANKMASK(PSPCON), 6, b
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ANCON0), 0, b
#define PCFG1                            BANKMASK(ANCON0), 1, b
#define PCFG10                           BANKMASK(ANCON1), 2, b
#define PCFG11                           BANKMASK(ANCON1), 3, b
#define PCFG12                           BANKMASK(ANCON1), 4, b
#define PCFG13                           BANKMASK(ANCON1), 5, b
#define PCFG14                           BANKMASK(ANCON1), 6, b
#define PCFG2                            BANKMASK(ANCON0), 2, b
#define PCFG3                            BANKMASK(ANCON0), 3, b
#define PCFG4                            BANKMASK(ANCON0), 4, b
#define PCFG5                            BANKMASK(ANCON0), 5, b
#define PCFG6                            BANKMASK(ANCON0), 6, b
#define PCFG7                            BANKMASK(ANCON0), 7, b
#define PCFG8                            BANKMASK(ANCON1), 0, b
#define PCFG9                            BANKMASK(ANCON1), 1, b
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSPCON2), 2, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PMPTTL                           BANKMASK(PADCFG1), 0, b
#define POR                              BANKMASK(RCON), 1, a
#define PRSEG0                           BANKMASK(BRGCON2), 0, b
#define PRSEG1                           BANKMASK(BRGCON2), 1, b
#define PRSEG2                           BANKMASK(BRGCON2), 2, b
#define PSA                              BANKMASK(T0CON), 3, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMD                            BANKMASK(PMD1), 7, b
#define PSPMODE                          BANKMASK(PSPCON), 4, b
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0DBEN                          BANKMASK(RXB0CON), 2, a
#define RB0DBEN_FILHIT2                  BANKMASK(RXB0CON), 2, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
